Winterviking/code_examples/uartled/INCLUDE/MDR1986VE1T_Add.h
/*
Purpose is clear
remove MILANDR MDR code from project
*/

#ifndef __MDR_DEFINITIONS_H_INCLUDED__
#define __MDR_DEFINITIONS_H_INCLUDED__

#include <config.h>
#include <MDR1986VE1T.h>

/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
// Convertion :::: FILE MDR32F9Qx_rst_clk.h /******************************DONE-100%****************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/

//
//
//RST_CLK_Exported_Types RST_CLK Exported Types
//
//

// Structure type for modules clocks frequencies expressed in Hz

typedef struct
{
  uint32_t CPU_CLK_Frequency;
  uint32_t USB_CLK_Frequency;
  uint32_t ADC_CLK_Frequency;
  uint32_t RTCHSI_Frequency;
  uint32_t RTCHSE_Frequency;
} RST_CLK_FreqTypeDef;

/***************************************************************************************************************/

// RST_CLK unit non-volatile settings init structure

typedef struct
{
     uint32_t REG_0F;
} Init_NonVolatile_RST_CLK_TypeDef;

//
//
// End of group RST_CLK_Exported_Types
//
//

//
//
// RST_CLK_Exported_Constants RST_CLK Exported Constants
//
//

/***************************************************************************************************************/

// HSE_configuration HSE configuration
// RST_CLK HSE (High Speed External) clock mode and source selection constants

#define RST_CLK_HSE_OFF                      ((uint32_t)0x00000000)
#define RST_CLK_HSE_ON                       ((uint32_t)0x00000001)
#define RST_CLK_HSE_Bypass                   ((uint32_t)0x00000002)

#define IS_RST_CLK_HSE(HSE)                  (((HSE) == RST_CLK_HSE_OFF) || \
                                              ((HSE) == RST_CLK_HSE_ON)  || \
                                              ((HSE) == RST_CLK_HSE_Bypass))

// End of group HSE_configuration

/***************************************************************************************************************/

// VE1T
// HSE2_configuration HSE2 configuration
// RST_CLK HSE2 (High Speed External 2 ) clock mode and source selection constants

#define RST_CLK_HSE2_OFF                                                ((uint32_t)0x00000000)
#define RST_CLK_HSE2_ON                                                 ((uint32_t)0x00000004)
#define RST_CLK_HSE2_Bypass                                             ((uint32_t)0x00000008)

#define IS_RST_CLK_HSE2(HSE2)                   (((HSE2) == RST_CLK_HSE2_OFF) || \
                                                 ((HSE2) == RST_CLK_HSE2_ON)  || \
                                                 ((HSE2) == RST_CLK_HSE2_Bypass))

// End of group HSE2_configuration

/***************************************************************************************************************/

// LSE_configuration LSE configuration
// RST_CLK LSE (Low Speed External) clock mode and source selection constants

#define RST_CLK_LSE_OFF                      ((uint32_t)0x00000000)
#define RST_CLK_LSE_ON                       ((uint32_t)0x00000001)
#define RST_CLK_LSE_Bypass                   ((uint32_t)0x00000002)

#define IS_RST_CLK_LSE(LSE)                  (((LSE) == RST_CLK_LSE_OFF) || \
                                              ((LSE) == RST_CLK_LSE_ON)  || \
                                              ((LSE) == RST_CLK_LSE_Bypass))

// End of group LSE_configuration

/***************************************************************************************************************/

// CPU_PLL_entry_clock_source CPU PLL entry clock source
// RST_CLK CPU_PLL clock mode and source selection constants

#define RST_CLK_CPU_PLLsrcHSIdiv1           ((uint32_t)0x00000000)
#define RST_CLK_CPU_PLLsrcHSIdiv2           ((uint32_t)0x00000001)
#define RST_CLK_CPU_PLLsrcHSEdiv1           ((uint32_t)0x00000002)
#define RST_CLK_CPU_PLLsrcHSEdiv2           ((uint32_t)0x00000003)

#define IS_RST_CLK_CPU_PLL_SOURCE(SRC)      (((SRC) == RST_CLK_CPU_PLLsrcHSIdiv1) || \
                                             ((SRC) == RST_CLK_CPU_PLLsrcHSIdiv2) || \
                                             ((SRC) == RST_CLK_CPU_PLLsrcHSEdiv1) || \
                                             ((SRC) == RST_CLK_CPU_PLLsrcHSEdiv2))

// End of group CPU_PLL_entry_clock_source

/***************************************************************************************************************/

// C2 Source
#define RST_CLK_CPU_C2_SRC_CPU_C1           ((uint32_t)0x00000000)
#define RST_CLK_CPU_C2_SRC_CPU_PLL0         ((uint32_t)0x00000004)


/***************************************************************************************************************/


// CPU_PLL_clock_multiplier CPU_PLL clock multiplier
// RST_CLK PLL_CPU_MUL multiplier of the CPU_C1 clock constants

#define RST_CLK_CPU_PLLmul1                     ((uint32_t)0x00000000)
#define RST_CLK_CPU_PLLmul2                     ((uint32_t)0x00000001)
#define RST_CLK_CPU_PLLmul3                     ((uint32_t)0x00000002)
#define RST_CLK_CPU_PLLmul4                     ((uint32_t)0x00000003)
#define RST_CLK_CPU_PLLmul5                     ((uint32_t)0x00000004)
#define RST_CLK_CPU_PLLmul6                     ((uint32_t)0x00000005)
#define RST_CLK_CPU_PLLmul7                     ((uint32_t)0x00000006)
#define RST_CLK_CPU_PLLmul8                     ((uint32_t)0x00000007)
#define RST_CLK_CPU_PLLmul9                     ((uint32_t)0x00000008)
#define RST_CLK_CPU_PLLmul10                    ((uint32_t)0x00000009)
#define RST_CLK_CPU_PLLmul11                    ((uint32_t)0x0000000A)
#define RST_CLK_CPU_PLLmul12                    ((uint32_t)0x0000000B)
#define RST_CLK_CPU_PLLmul13                    ((uint32_t)0x0000000C)
#define RST_CLK_CPU_PLLmul14                    ((uint32_t)0x0000000D)
#define RST_CLK_CPU_PLLmul15                    ((uint32_t)0x0000000E)
#define RST_CLK_CPU_PLLmul16                    ((uint32_t)0x0000000F)

#define IS_RST_CLK_CPU_PLL_MUL(SRC)             ((SRC>=0) && (SRC<16))

// End of group CPU_PLL_clock_multiplier

/***************************************************************************************************************/

// USB_PLL_entry_clock_source USB PLL entry clock source
// RST_CLK USB_PLL clock mode and source selection constants


