Winterviking/code_examples/uartled/INCLUDE/MDR1986VE1T_Add.h
#define RST_CLK_ADCclkDIV1                    ((uint32_t)0x00000000)
#define RST_CLK_ADCclkDIV2                    ((uint32_t)0x00000008)
#define RST_CLK_ADCclkDIV4                    ((uint32_t)0x00000009)
#define RST_CLK_ADCclkDIV8                    ((uint32_t)0x0000000A)
#define RST_CLK_ADCclkDIV16                   ((uint32_t)0x0000000B)
#define RST_CLK_ADCclkDIV32                   ((uint32_t)0x0000000C)
#define RST_CLK_ADCclkDIV64                   ((uint32_t)0x0000000D)
#define RST_CLK_ADCclkDIV128                  ((uint32_t)0x0000000E)
#define RST_CLK_ADCclkDIV256                  ((uint32_t)0x0000000F)

#define IS_RST_CLK_ADCclkDivValue(SRC)        (((SRC) == RST_CLK_ADCclkDIV1)    || \
                                               ((SRC) == RST_CLK_ADCclkDIV2)    || \
                                               ((SRC) == RST_CLK_ADCclkDIV4)    || \
                                               ((SRC) == RST_CLK_ADCclkDIV8)    || \
                                               ((SRC) == RST_CLK_ADCclkDIV16)   || \
                                               ((SRC) == RST_CLK_ADCclkDIV32)   || \
                                               ((SRC) == RST_CLK_ADCclkDIV64)   || \
                                               ((SRC) == RST_CLK_ADCclkDIV128)  || \
                                               ((SRC) == RST_CLK_ADCclkDIV256))

// End of group ADC_MCO_CS3_SEL

/***************************************************************************************************************/

// AUC_MCO_CLOCK_source AUC clock source
// RST_CLK AUC_CLK selector constants

#define RST_CLK_AUCclkHSI_C1                                            ((uint32_t)0x00000000)
#define RST_CLK_AUCclkHSI_2_C1                                          ((uint32_t)0x00010000)
#define RST_CLK_AUCclkHSE_C1                                            ((uint32_t)0x00020000)
#define RST_CLK_AUCclkHSE_2_C1                                          ((uint32_t)0x00030000)
#define RST_CLK_AUCclkPLLCPU                                            ((uint32_t)0x00100000)
#define RST_CLK_AUCclkPLLUSB                                            ((uint32_t)0x00200000)

#define IS_RST_CLK_AUCclk(SRC)                                          (((SRC) == RST_CLK_AUCclkHSI_C1)   || \
                                                                                                         ((SRC) == RST_CLK_AUCclkHSI_2_C1) || \
                                                                                                         ((SRC) == RST_CLK_AUCclkHSE_C1)   || \
                                                                                                         ((SRC) == RST_CLK_AUCclkHSE_2_C1) || \
                                                                                                         ((SRC) == RST_CLK_AUCclkPLLCPU)   || \
                                                                                                         ((SRC) == RST_CLK_AUCclkPLLUSB))
// End of group AUC_MCO_CLOCK_source

/***************************************************************************************************************/

// AUCclkDIV_divider AUC MCO divider
// AUC_MCO_CLK AUC_CLK output clock AUC_CLK_DIV divider

#define RST_CLK_AUCclkDIV1                                                      ((uint32_t)0x00000000)
#define RST_CLK_AUCclkDIV2                                                      ((uint32_t)0x08000000 | 0x00000000)
#define RST_CLK_AUCclkDIV4                                                      ((uint32_t)0x08000000 | 0x01000000)
#define RST_CLK_AUCclkDIV8                                                      ((uint32_t)0x08000000 | 0x02000000)
#define RST_CLK_AUCclkDIV16                                                     ((uint32_t)0x08000000 | 0x03000000)
#define RST_CLK_AUCclkDIV32                                                     ((uint32_t)0x08000000 | 0x04000000)
#define RST_CLK_AUCclkDIV64                                                     ((uint32_t)0x08000000 | 0x05000000)
#define RST_CLK_AUCclkDIV128                                            ((uint32_t)0x08000000 | 0x06000000)
#define RST_CLK_AUCclkDIV256                                            ((uint32_t)0x08000000 | 0x07000000)

#define IS_RST_CLK_AUCclkDIV(DIV)                                       (((DIV) == RST_CLK_AUCclkDIV1)   || \
                                                                                                         ((DIV) == RST_CLK_AUCclkDIV2)   || \
                                                                                                         ((DIV) == RST_CLK_AUCclkDIV4)   || \
                                                                                                         ((DIV) == RST_CLK_AUCclkDIV8)   || \
                                                                                                         ((DIV) == RST_CLK_AUCclkDIV16)  || \
                                                                                                         ((DIV) == RST_CLK_AUCclkDIV32)  || \
                                                                                                         ((DIV) == RST_CLK_AUCclkDIV64)  || \
                                                                                                         ((DIV) == RST_CLK_AUCclkDIV128) || \
                                                                                                         ((DIV) == RST_CLK_AUCclkDIV256))
// End of group AUCclkDIV_divider

/***************************************************************************************************************/

// CLK_peripheral CLK peripheral
// RST_CLK peripheral modules clock constants

#define PCLK_BIT(BASE)              ((uint32_t)(1 << ((((uint32_t)BASE) >> 15) & 0x1F)))

// VE1T
        #define RST_CLK_PCLK_CAN1           PCLK_BIT(MDR_CAN1_BASE)
        #define RST_CLK_PCLK_CAN2           PCLK_BIT(MDR_CAN2_BASE)
        #define RST_CLK_PCLK_USB            PCLK_BIT(MDR_USB_BASE)
        #define RST_CLK_PCLK_EEPROM         PCLK_BIT(MDR_EEPROM_BASE)
        #define RST_CLK_PCLK_RST_CLK        PCLK_BIT(MDR_RST_CLK_BASE)
        #define RST_CLK_PCLK_DMA            PCLK_BIT(MDR_DMA_BASE)
        #define RST_CLK_PCLK_UART1          PCLK_BIT(MDR_UART1_BASE)
        #define RST_CLK_PCLK_UART2          PCLK_BIT(MDR_UART2_BASE)
        #define RST_CLK_PCLK_SSP1           PCLK_BIT(MDR_SSP1_BASE)
        #define RST_CLK_PCLK_MIL_STD_15531  PCLK_BIT(MDR_MIL_STD_15531_BASE)
        #define RST_CLK_PCLK_MIL_STD_15532  PCLK_BIT(MDR_MIL_STD_15532_BASE)
        #define RST_CLK_PCLK_POWER          PCLK_BIT(MDR_POWER_BASE)
        #define RST_CLK_PCLK_WWDG           PCLK_BIT(MDR_WWDG_BASE)
        #define RST_CLK_PCLK_IWDG           PCLK_BIT(MDR_IWDG_BASE)
        #define RST_CLK_PCLK_TIMER1         PCLK_BIT(MDR_TIMER1_BASE)
        #define RST_CLK_PCLK_TIMER2         PCLK_BIT(MDR_TIMER2_BASE)
        #define RST_CLK_PCLK_TIMER3         PCLK_BIT(MDR_TIMER3_BASE)
        #define RST_CLK_PCLK_ADC            PCLK_BIT(MDR_ADC_BASE)
        #define RST_CLK_PCLK_DAC            PCLK_BIT(MDR_DAC_BASE)
        #define RST_CLK_PCLK_TIMER4         PCLK_BIT(MDR_TIMER4_BASE)
        #define RST_CLK_PCLK_SSP2           PCLK_BIT(MDR_SSP2_BASE)
        #define RST_CLK_PCLK_PORTA          PCLK_BIT(MDR_PORTA_BASE)
        #define RST_CLK_PCLK_PORTB          PCLK_BIT(MDR_PORTB_BASE)
        #define RST_CLK_PCLK_PORTC          PCLK_BIT(MDR_PORTC_BASE)
        #define RST_CLK_PCLK_PORTD          PCLK_BIT(MDR_PORTD_BASE)
        #define RST_CLK_PCLK_PORTE          PCLK_BIT(MDR_PORTE_BASE)
        #define RST_CLK_PCLK_ARINC429R      PCLK_BIT(MDR_ARINC429R_BASE)
        #define RST_CLK_PCLK_BKP            PCLK_BIT(MDR_BKP_BASE)
        #define RST_CLK_PCLK_ARINC429T      PCLK_BIT(MDR_ARINC429T_BASE)
        #define RST_CLK_PCLK_PORTF          PCLK_BIT(MDR_PORTF_BASE)
        #define RST_CLK_PCLK_EBC            PCLK_BIT(MDR_EBC_BASE)
        #define RST_CLK_PCLK_SSP3           PCLK_BIT(MDR_SSP3_BASE)

