Winterviking/code_examples/uartled/INCLUDE/MDR1986VE1T_Add.h
typedef enum
{
  Bit_RESET = 0,
  Bit_SET
}BitAction;

#define IS_PORT_BIT_ACTION(ACTION) (((ACTION) == Bit_RESET) || ((ACTION) == Bit_SET))

//
//
// End of group PORT_Exported_Types
//
//

//
//
//PORT_Exported_Constants PORT Exported Constants
//
//

// PORT_JTAG_define PORT JTAG define

/*
#if defined (USE_JTAG_A)
#define PORT_JTAG                   MDR_PORTB    // Port containing JTAG interface
#define PORT_JTAG_Msk               0x001FU      // JTAG pins

#elif defined (USE_JTAG_B)
#define PORT_JTAG                   MDR_PORTD    // Port containing JTAG interface
#define PORT_JTAG_Msk               0x001FU      // JTAG pins

#endif


#if defined (PORT_JTAG)
#define JTAG_PINS(PORT)             (((PORT) == PORT_JTAG) ? PORT_JTAG_Msk : 0)

#else
#define JTAG_PINS(PORT)             0

#endif

#define IS_NOT_JTAG_PIN(PORT, PIN)  (((PIN) & JTAG_PINS(PORT)) == 0x00)

*/

// End of group PORT_JTAG_define

/***************************************************************************************************************/

// PORT_pins_define PORT pins define

#define PORT_Pin_0                  0x0001U  /*!< Pin 0 selected */
#define PORT_Pin_1                  0x0002U  /*!< Pin 1 selected */
#define PORT_Pin_2                  0x0004U  /*!< Pin 2 selected */
#define PORT_Pin_3                  0x0008U  /*!< Pin 3 selected */
#define PORT_Pin_4                  0x0010U  /*!< Pin 4 selected */
#define PORT_Pin_5                  0x0020U  /*!< Pin 5 selected */
#define PORT_Pin_6                  0x0040U  /*!< Pin 6 selected */
#define PORT_Pin_7                  0x0080U  /*!< Pin 7 selected */
#define PORT_Pin_8                  0x0100U  /*!< Pin 8 selected */
#define PORT_Pin_9                  0x0200U  /*!< Pin 9 selected */
#define PORT_Pin_10                 0x0400U  /*!< Pin 10 selected */
#define PORT_Pin_11                 0x0800U  /*!< Pin 11 selected */
#define PORT_Pin_12                 0x1000U  /*!< Pin 12 selected */
#define PORT_Pin_13                 0x2000U  /*!< Pin 13 selected */
#define PORT_Pin_14                 0x4000U  /*!< Pin 14 selected */
#define PORT_Pin_15                 0x8000U  /*!< Pin 15 selected */
#define PORT_Pin_All                0xFFFFU  /*!< All pins selected */

#define IS_PORT_PIN(PIN)            ((((PIN) & (uint32_t)0xFFFF0000UL) == 0x00) && \
                                     ((PIN) != 0x00))

#define IS_GET_PORT_PIN(PIN)        (((PIN) == PORT_Pin_0 ) || \
                                     ((PIN) == PORT_Pin_1 ) || \
                                     ((PIN) == PORT_Pin_2 ) || \
                                     ((PIN) == PORT_Pin_3 ) || \
                                     ((PIN) == PORT_Pin_4 ) || \
                                     ((PIN) == PORT_Pin_5 ) || \
                                     ((PIN) == PORT_Pin_6 ) || \
                                     ((PIN) == PORT_Pin_7 ) || \
                                     ((PIN) == PORT_Pin_8 ) || \
                                     ((PIN) == PORT_Pin_9 ) || \
                                     ((PIN) == PORT_Pin_10) || \
                                     ((PIN) == PORT_Pin_11) || \
                                     ((PIN) == PORT_Pin_12) || \
                                     ((PIN) == PORT_Pin_13) || \
                                     ((PIN) == PORT_Pin_14) || \
                                     ((PIN) == PORT_Pin_15))

// End of group PORT_pins_define

//
//
// End of group PORT_Exported_Constants
//
//

//
//
// PORT.H ends heres
//
//

// init ports

//
//
// PORT DEFINITION MACRO FUNCTIONS ))))))))
//
//

#define PIN_(pin__,value__,size__) ((int)value << (pin__*size__))
#define PIN1_(pin__,value__) PIN_(pin__,value__,1)
#define PIN2_(pin__,value__) PIN_(pin__,value__,2)

#define PORT_EDIT__(reg__,pins__) reg__ |= pins__
#define PORT_INIT__(reg__, pins__) reg__ = pins__;

// xample:
/*
  MDR_PORTA->OE     = PORT_INIT__(
                                        PIN1_(PORT_Pin_0,       PORT_OE_OUT)    |
                                        PIN1_(PORT_Pin_1,       PORT_OE_IN)     |
                                        PIN1_(PORT_Pin_2,       PORT_OE_OUT)    |
                                        PIN1_(PORT_Pin_13,      PORT_OE_IN)
                                  );
  MDR_PORTA->FUNC   = PORT_INIT__(
                                        PIN2_(PORT_Pin_0,       PORT_FUNC_ALTER)        |
                                        PIN2_(PORT_Pin_1,       PORT_FUNC_MAIN)         |
                                        PIN2_(PORT_Pin_2,       PORT_FUNC_ALTER)        |
                                        PIN2_(PORT_Pin_13,      PORT_FUNC_OVERRID)
                                  );



  MDR_PORTA->ANALOG = PIN1_
  MDR_PORTA->PULL   = PIN2_;
  MDR_PORTA->PD     = PIN2_;
  MDR_PORTA->PWR    = PIN2_;
  MDR_PORTA->GFEN   = PIN1_;

*/

// CAUTION :: no jtag filtering
#define PORT_RESET_PINS(PORT__) PORT__->CLRTX = PORT__ // PORT_Pin_X

#define PORT_SET_BIT(PORT__,Pin__) PORT__->SETTX |= (1 << Pin__)
#define PORT_CLR_BIT(PORT__,Pin__) PORT__->CLRTX |= (1 << Pin__)





















































//
//
// RST CLOCK C DEFINITIONS //// use if possible
//
//

// RST_CLK RST_CLK
// RST_CLK_Private_Constants RST_CLK Private Constants

// RCC_CLK registers bit address in the alias region
#define PERIPH_BASE                 0x40000000
#define PERIPH_BB_BASE              0x42000000
#define RST_CLK_OFFSET              (MDR_RST_CLK_BASE - PERIPH_BASE)
#define BKP_OFFSET                  (MDR_BKP_BASE - PERIPH_BASE)

#define SFR_OFFSET(TP, MOD, SFR)    ((uint32_t)&((TP*)MOD)->SFR)
#define BB_ADDR(TP, MOD, SFR, BIT)  (PERIPH_BB_BASE + SFR_OFFSET(TP, MOD, SFR)*32 + BIT*4)
#define RST_CLK_BB(SFR, BIT)        BB_ADDR(MDR_RST_CLK_TypeDef, RST_CLK_OFFSET, SFR, BIT)
#define BKP_BB(SFR, BIT)            BB_ADDR(MDR_BKP_TypeDef, BKP_OFFSET, SFR, BIT)

#define FLAG_MASK                   ((uint8_t)0x1F)
#define FLAG_SFR_MASK               ((uint8_t)0xE0)

#define HSI_RDY_MASK                (1 << 23)
#define LSI_RDY_MASK                (1 << 21)
#define LSE_RDY_MASK                (1 << 13)
#define HSE_RDY_MASK                (1 << 2)
#define HSE2_RDY_MASK                   (1 << 3)
#define PLLCPU_RDY_MASK             (1 << 1)
#define PLLUSB_RDY_MASK             (1 << 0)
#define PLLCPUMUL_OFFSET            8
#define PLLCPUmulclr                (~(uint32_t)(0x0F << PLLCPUMUL_OFFSET))
#define PLLUSBMUL_OFFSET            4
#define PLLUSBmulclr                (~(uint32_t)(0x0F << PLLUSBMUL_OFFSET))
#define CPU_C1_SELclr               (~(uint32_t)0x03)
#define CPU_C3_SELclr               (~(uint32_t)0x00000F0)
#define CPU_HCLK_SELclr             (~(uint32_t)(0x03 << 8))
#define ADC_C12_SELclr              (~(uint32_t)((0x03 << 4) | 0x03))
#define AUC_C12_SELclr              (~(uint32_t)((0x03 << 20) | (0x03 << 16)))
#define AUC_C3_SELclr                   (~(uint32_t)((0xF<<24)))
#define ADC_C3_SEL_OFFSET           8
#define ADC_C3_SELclr               (~(uint32_t)(0x0F << ADC_C3_SEL_OFFSET))
#define HSI_SEL_OFFSET              4
#define HSI_SELclr                  (~(uint32_t)(0x0F << HSI_SEL_OFFSET))
#define HSE_SEL_OFFSET              0
#define HSE_SELclr                  (~(uint32_t)(0x0F << HSE_SEL_OFFSET))
#define USB_C1_SELclr               (~(uint32_t)0x03)


