Winterviking/code_examples/uartled/INCLUDE/MDR1986VE1T_Add.h
#define HSITRIM_OFFSET              24
#define HSITRIM_MASK                ((uint32_t)(0x3F << HSITRIM_OFFSET))

#define HSION_OFFSET                22
#define HSION_MASK                  ((uint32_t)(1 << HSION_OFFSET))

#define LSITRIM_OFFSET              16
#define LSITRIM_MASK                ((uint32_t)(0x1F << LSITRIM_OFFSET))

#define LSION_OFFSET                15
#define LSION_MASK                  ((uint32_t)(1 << LSION_OFFSET))






























//
//
// MIL_STD_1553
//
//


//
//
// MIL_STD_1553_Exported_Types MIL_STD_1553 Exported Types
//
//

// MIL_STD_1553 Init Structure definition
typedef struct {
        uint32_t MIL_STD_1553_Mode; // This member configures the MIL_STD_1553 mode.                    This parameter is one of MIL_STD_1553_Mode values
        uint32_t MIL_STD_1553_RERR; // This member configures the resetting of errors in TD mode.       This parameter can be: ENABLE or DISABLE
        uint32_t MIL_STD_1553_DIV;  // This member configures the MIL_STD_1553 clock divider. [0..127] If MAN_CLK not a multiple of 8 then DIV[6:3]=(MAN_CLK/8)+1, DIV[2:0]=0, but the stability of reception is not guaranteed.
        uint32_t MIL_STD_1553_RTA;  // This member configures the address of the terminal device. This parameter is value from 0 to 0x1E
        uint32_t MIL_STD_1553_TRB;  // This member configures the Transmission block the backup channel. This parameter can be: ENABLE or DISABLE.
        uint32_t MIL_STD_1553_TRA;  // This member configures the Transmission block the main channel. This parameter can be: ENABLE or DISABLE.

        // REVISION 3 availability
        FunctionalState MIL_STD_1553_Inversion_Signals;     // This member enables or disables the inversion signals PRD_PRMA, PRD_PRMB, PRD_PRMC, PRD_PRMD. This parameter can be: ENABLE or DISABLE.
        FunctionalState MIL_STD_1553_Filtration_Flow;       // This option enables or disables the filtering flow NRZ, in the case of drivers with nekkorektno duty cycle and pulse width of NRZ code. This parameter can be: ENABLE or DISABLE. */
        FunctionalState MIL_STD_1553_Automatic_Adjustment;  // This member enables or disables the automatic adjustment of the mid bit intervals. This parameter can be: ENABLE or DISABLE. */
} MIL_STD_1553_InitTypeDef;

/***************************************************************************************************************/

// Data Fields Union definition

typedef union {
        uint32_t NumberDataWords        :5; // Specifies the number of data word in a message.
        uint32_t Cmd                    :5; // Specifies the command type.
} Data_FieldsTypeDef;

/***************************************************************************************************************/

// MIL_STD_1553 CommandWord Bit Fields definition
typedef struct {
        //Data_FieldsTypeDef Data;
        uint32_t Data                   :5;     // Specifies the number of data word in a message or command type. This parameter is number from 0 to 0x1F.
        uint32_t Subaddress             :5;     // Specifies the code subaddress OU or code attribute control mode 00000 or 11111. This parameter is number from 0 to 0x1F.
        uint32_t ReadWriteBit           :1;     // Specifies the action to execute TD (receive or transmit DW). This parameter is one of @ref MIL_STD_READ_WRITE_BIT values.
        uint32_t TerminalDeviceAddress  :5;     // Specifies the address of TD, which is intended CW. This parameter is number from 0 to 0x1F.
} MIL_STD_1553_CommandWordBitFields;

/***************************************************************************************************************/

// MIL_STD_1553 CommandWord Unioun definition
typedef union {
        uint32_t                                CommandWord; // Specifies the fully Command Word.
        MIL_STD_1553_CommandWordBitFields       Fields;      // Specifies the particular field of the Command Word.
} MIL_STD_1553_CommandWordTypeDef;

/***************************************************************************************************************/

// MIL_STD_1553 StatusWord Bit Fields definition
typedef struct {
        uint32_t        FaultTDBit                      :1; // Specifies the fault terminal device. This parameter can be: SET or RESET.
        uint32_t        AdoptionControlInterfaceBit     :1; // Specifies the adoption control interface. This parameter can be: SET or RESET.
        uint32_t        AbonentFaultBit                 :1; // Specifies the fault abonent. This parameter can be: SET or RESET.
        uint32_t        BusyBit                         :1; // Specifies the busy abonent. This parameter can be: SET or RESET.
        uint32_t        GroupCommandBit                 :1; // Specifies the group command. This parameter can be: SET or RESET.
        uint32_t        Reserved                        :3; // Reserved
        uint32_t        ServiceRequestBit               :1; // Specifies the service request. This parameter can be: SET or RESET.
        uint32_t        TransferReplyWordBit            :1; // Specifies the transfer replay word. This parameter can be: SET or RESET.
        uint32_t        ErrorBit                        :1; // Specifies the error in the message. This parameter can be: SET or RESET.
        uint32_t        TerminalDeviceAddress           :5; // Specifies the termnal device address. This parameter is number from 0x00 to 0x1F.
} MIL_STD_1553_StatusWordBitFields;

/***************************************************************************************************************/

// MIL_STD_1553 StatusWord Structure definition
typedef union {
        uint32_t                                StatusWord; // Specifies the fully Status Word.
        MIL_STD_1553_StatusWordBitFields        Fields;     // Specifies the particular field of the Status Word.
} MIL_STD_1553_StatusWordTypeDef;

/***************************************************************************************************************/

// Bool Structure definition
typedef enum {
        FALSE = 0,
        TRUE = !DISABLE
} Bool;

//
//
// End of group MIL_STD_1553_Exported_Types
//
//

//
//
// MIL_STD_1553_Exported_Macros MIL_STD_1553 Exported Macros
//
//

#define IS_MIL_STD_1553_ALL_PERIPH(PERIPH)              (((PERIPH) == MDR_MIL_STD_15531) ||\
                                                         ((PERIPH) == MDR_MIL_STD_15532))

#define IS_MIL_STD_1553_DEVIDER(DIVIDER)                ((DIVIDER) <= 0x7F)

#define IS_MIL_STD_1553_RTA(RTA)                        ((RTA) <= 0x1F)

/***************************************************************************************************************/

// MIL_STD_1553_Mode MIL_STD_1553 Mode
#define MIL_STD_1553_ModeBusController                  ((uint32_t)0x01)
#define MIL_STD_1553_ModeTerminal                       ((uint32_t)0x02)
#define MIL_STD_1553_ModeMonitor                        ((uint32_t)0x03)

