Winterviking/code_examples/uartled/INCLUDE/MDR1986VE1T_Add.h
#define MIL_STD_1553_MODE_Pos                           2

#define IS_MIL_STD_1553_MODE(MODE)                      (((MODE) == MIL_STD_1553_ModeBusController) ||\
                                                         ((MODE) == MIL_STD_1553_ModeMonitor)       ||\
                                                         ((MODE) == MIL_STD_1553_ModeTerminal))

// End of group MIL_STD_1553_Mode

/***************************************************************************************************************/

// MIL_STD_READ_WRITE_BIT MIL_STD_READ_WRITE BIT
#define MIL_STD_1553_TD_TO_BC                           ((uint32_t)0x00000001)
#define MIL_STD_1553_BC_TO_TD                           ((uint32_t)0x00000000)

#define IS_MIL_STD_READ_WRITE_BIT(BIT)                  (((BIT) == MIL_STD_1553_TD_TO_BC) || \
                                                         ((BIT) == MIL_STD_1553_BC_TO_TD))

// End of group MIL_STD_READ_WRITE_BIT

/***************************************************************************************************************/

// MIL_STD_1553_Flags MIL_STD_1553 Flags
#define MIL_STD_1553_FLAG_IDLE                          ((uint32_t)0x00000001)
#define MIL_STD_1553_FLAG_RFLAGN                        ((uint32_t)0x00000002)
#define MIL_STD_1553_FLAG_VALMESS                       ((uint32_t)0x00000004)
#define MIL_STD_1553_FLAG_ERR                           ((uint32_t)0x00000008)
#define MIL_STD_1553_FLAG_RCVA                          ((uint32_t)0x00000010)
#define MIL_STD_1553_FLAG_RCVB                          ((uint32_t)0x00000020)

#define IS_MIL_STD_1553_FLAG(FLAG)                      (((FLAG) == MIL_STD_1553_FLAG_IDLE)     ||\
                                                         ((FLAG) == MIL_STD_1553_FLAG_RFLAGN)   ||\
                                                         ((FLAG) == MIL_STD_1553_FLAG_VALMESS)  ||\
                                                         ((FLAG) == MIL_STD_1553_FLAG_ERR)      ||\
                                                         ((FLAG) == MIL_STD_1553_FLAG_RCVA)     ||\
                                                         ((FLAG) == MIL_STD_1553_FLAG_RCVB))

// End of group MIL_STD_1553_Flags

/***************************************************************************************************************/

// MIL_STD_1553_Interrupt_defintion MIL_STD_1553 Interrupt defintion

#define MIL_STD_1553_IT_IDLEIE                          ((uint32_t)0x00000001)
#define MIL_STD_1553_IT_RFLAGNIE                        ((uint32_t)0x00000002)
#define MIL_STD_1553_IT_VALMESSIE                       ((uint32_t)0x00000004)
#define MIL_STD_1553_IT_ERRIE                           ((uint32_t)0x00000008)

#define MIL_STD_1553_IT_MASK                            (MIL_STD_1553_IT_IDLEIE         |\
                                                         MIL_STD_1553_IT_RFLAGNIE       |\
                                                         MIL_STD_1553_IT_VALMESSIE      |\
                                                         MIL_STD_1553_IT_ERRIE)

#define IS_MIL_STD_1553_IT(IT)                          ((IT) & (~MIL_STD_1553_IT_MASK) == 0)

/*
#define IS_MIL_STD_1553_IT(IT)                          (((IT) == MIL_STD_1553_IT_IDLEIE) ||\
                                                         ((IT) == MIL_STD_1553_IT_RFLAGNIE) ||\
                                                         ((IT) == MIL_STD_1553_IT_VALMESSIE) ||\
                                                         ((IT) == MIL_STD_1553_IT_ERRIE))
*/

// End of group MIL_STD_1553_Interrupt_defintion

/***************************************************************************************************************/

// MIL_STD_1553_Number_CommandWord MIL_STD_1553 Number CommandWord
#define MIL_STD_1553_COMMAND_WORD1                      ((uint32_t)0x00000000)
#define MIL_STD_1553_COMMAND_WORD2                      ((uint32_t)0x00000001)

#define IS_MIL_STD_1553_COMMAND_WORD(COMMAND_WORD)      ((COMMAND_WORD) < 0x02)

// End of group MIL_STD_1553_Number_CommandWord

/***************************************************************************************************************/

// MIL_STD_1553_Number_StatusWord MIL_STD_1553 Number StatusWord
#define MIL_STD_1553_STATUS_WORD1                                       ((uint32_t)0x00000000)
#define MIL_STD_1553_STATUS_WORD2                                       ((uint32_t)0x00000001)

#define IS_MIL_STD_1553_STATUS_WORD(STATUS_WORD)        ((STATUS_WORD) < 0x02)

// End of group MIL_STD_1553_Number_StatusWord

/***************************************************************************************************************/

// MIL_STD_1553_Number_Transmitter MIL_STD_1553 Number Transmitter
#define MIL_STD_1553_TRANSMITTER_MAIN                                   ((uint32_t)0x0000010)
#define MIL_STD_1553_TRANSMITTER_RESERVE                                ((uint32_t)0x0000020)

#define IS_MIL_STD_1553_TRANSMITTER_CHANNEL(CHANNEL)    (((CHANNEL) == MIL_STD_1553_TRANSMITTER_MAIN) ||\
                                                         ((CHANNEL) == MIL_STD_1553_TRANSMITTER_RESERVE))

/***************************************************************************************************************/

// clock brg

#define MIL_STD_1553_HCLKdiv1                                   ((uint32_t)0x00000000)
#define MIL_STD_1553_HCLKdiv2                                   ((uint32_t)0x00000001)
#define MIL_STD_1553_HCLKdiv4                                   ((uint32_t)0x00000002)
#define MIL_STD_1553_HCLKdiv8                                   ((uint32_t)0x00000003)
#define MIL_STD_1553_HCLKdiv16                                  ((uint32_t)0x00000004)
#define MIL_STD_1553_HCLKdiv32                                  ((uint32_t)0x00000005)
#define MIL_STD_1553_HCLKdiv64                                  ((uint32_t)0x00000006)
#define MIL_STD_1553_HCLKdiv128                                 ((uint32_t)0x00000007)

#define IS_MIL_STD_1553_BRG(BRG)                                ((BRG) <= 7)

//
//
// End of group MIL_STD_1553_Exported_Macros MIL_STD_1553 Exported Macros
//
//

//
//
// mil std 1553 c file defines
//
//

