Winterviking/code_examples/uartled/INCLUDE/MDR1986VE1T_Add.h
#define MR_EN_Set                       ((uint32_t)0x00000001)  /*!< MIL_STD_1553 Enable mask */
#define MR_EN_Reset                     ((uint32_t)0x0000FFFE)  /*!< MIL_STD_1553 Disable mask */
#define MIL_STD_1553_RESET              MR_EN_Set
#define MIL_STD_1553_START              MR_EN_Reset


/***************************************************************************************************************/

// FOR TESTS

#define IS_MIL_STD_1553_SUBADDRES(SUBADDRES)                    (((SUBADDRES) != 0) && \
                                                                 ((SUBADDRES) <= 0x1F))

#define IS_MIL_STD_1553_NUMBER_DATA_WORDS(NUMBER_DATA_WORDS)    (((NUMBER_DATA_WORDS) != 0 ) &&\
                                                                 ((NUMBER_DATA_WORDS) <= 32))

/***************************************************************************************************************/

// Status Word 1 ( Response Word ) Definitions
// MDR_MIL_STD_1553->StatusWord1

#define MIL_STD_1553_SW1_TERMINAL_DEVICE_FAULT                          0x0001
#define MIL_STD_1553_SW1_BUS_CONTROLLER_STATUS_TRANSITION_ACCEPTED      0x0002
#define MIL_STD_1553_SW1_NODE_FAULT                                     0x0004
#define MIL_STD_1553_SW1_NODE_BUSY                                      0x0008
#define MIL_STD_1553_SW1_GROUP_COMMAND_RECEIVED                         0x0010
// RESERVED                                                             0x00E0
#define MIL_STD_1553_SW1_SERVICE_REQUEST                                0x0100
#define MIL_STD_1553_SW1_TRANSMITTING_RESPONSE_WORD                     0x0200
#define MIL_STD_1553_SW1_MESSAGE_ERROR                                  0x0400
#define MIL_STD_1553_SW1_TERMINAL_DEIVICE_ADDRESS_Msk                   0xF800


#define MIL_STD_1553_SW1_TERMINAL_DEVICE_FAULT_Pos                      0
#define MIL_STD_1553_SW1_BUS_CONTROLLER_STATUS_TRANSITION_ACCEPTED_Pos  1
#define MIL_STD_1553_SW1_NODE_FAULT_Pos                                 2
#define MIL_STD_1553_SW1_NODE_BUSY_Pos                                  3
#define MIL_STD_1553_SW1_GROUP_COMMAND_RECEIVED_Pos                     4
// RESERVED                                                             5-7
#define MIL_STD_1553_SW1_SERVICE_REQUEST_Pos                            8
#define MIL_STD_1553_SW1_TRANSMITTING_RESPONSE_WORD_Pos                 9
#define MIL_STD_1553_SW1_MESSAGE_ERROR_Pos                              10
#define MIL_STD_1553_SW1_TERMINAL_DEIVICE_ADDRESS_Pos                   11











































/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
// Convertion :::: FILE MDR32F9Qx_eeprom.h /******************************DONE-100%*****************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/

//
//
// EEPROM_Exported_Constants EEPROM Exported Constants
//
//

// EEPROM_Latency EEPROM Latency

#define EEPROM_Latency_0                ((uint32_t)0x00000000)  // EEPROM 0 Latency cycle  (MCU Clock up to  25 MHz)
#define EEPROM_Latency_1                ((uint32_t)0x00000008)  // EEPROM 1 Latency cycle  (MCU Clock up to  50 MHz)
#define EEPROM_Latency_2                ((uint32_t)0x00000010)  // EEPROM 2 Latency cycles (MCU Clock up to  75 MHz)
#define EEPROM_Latency_3                ((uint32_t)0x00000018)  // EEPROM 3 Latency cycles (MCU Clock up to 100 MHz)
#define EEPROM_Latency_4                ((uint32_t)0x00000020)  // EEPROM 4 Latency cycles (MCU Clock up to 125 MHz)
#define EEPROM_Latency_5                ((uint32_t)0x00000028)  // EEPROM 5 Latency cycles (MCU Clock up to 150 MHz)
#define EEPROM_Latency_6                ((uint32_t)0x00000030)  // EEPROM 6 Latency cycles (MCU Clock up to 175 MHz)
#define EEPROM_Latency_7                ((uint32_t)0x00000038)  // EEPROM 7 Latency cycles (MCU Clock up to 200 MHz)

#define EEPROM_Latency_MSK      ((uint32_t)0x00000038)

#define IS_EEPROM_LATENCY(EEPROM_Latency) (((EEPROM_Latency) & (~EEPROM_Latency_MSK)) == 0x0)

// End of group EEPROM_Latency

/***************************************************************************************************************/

// EEPROM_Bank EEPROM Bank Selector

#define EEPROM_Main_Bank_Select         ((uint32_t)0x00000000)  // EEPROM Main Bank Selector
#define EEPROM_Info_Bank_Select         ((uint32_t)0x00000001)  // EEPROM Information Bank Selector
#define EEPROM_All_Banks_Select         ((uint32_t)0x00000002)  // EEPROM All Banks Selector

#define IS_EEPROM_BANK_SELECTOR(SEL)    (((SEL) == EEPROM_Main_Bank_Select) || \
                                         ((SEL) == EEPROM_Info_Bank_Select))

#define IS_EEPROM_ERASE_SELECTOR(SEL)   (((SEL) == EEPROM_Main_Bank_Select) || \
                                         ((SEL) == EEPROM_All_Banks_Select))

// End of group EEPROM_Bank

//
//
//End of group EEPROM_Exported_Constants
//
//

// from eemrom c file

#define EEPROM_REG_ACCESS_KEY           ((uint32_t)0x8AAA5551)

#define IS_TWO_BYTE_ALLIGNED(ADDR)      ((ADDR & 1) == 0)
#define IS_FOUR_BYTE_ALLIGNED(ADDR)     ((ADDR & 3) == 0)

#define DELAY_LOOP_CYCLES               (8UL)
#define GET_US_LOOPS(N)                 ((uint32_t)((float)(N) * FLASH_PROG_FREQ_MHZ / DELAY_LOOP_CYCLES))





















































/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
// Convertion :::: FILE MDR32F9Qx_timer.h /******************************DONE-100%******************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/

//
//
// TIMER_Exported_Types TIMER Exported Types
//
//

// TIMER Counter Init structure definition

