Winterviking/code_examples/uartled/INCLUDE/MDR1986VE1T_Add.h
typedef struct {

        uint32_t TIMER_IniCounter;      // Specifies the initial counter value. This parameter can be a number between 0x0000 and 0xFFFFFFFF.
        uint16_t TIMER_Prescaler;       // Specifies the prescaler value used to divide the TIMER clock. This parameter can be a number between 0x0000 and 0xFFFF. CLK = TIMER_CLK/(TIMER_Prescaler + 1)
        uint32_t TIMER_Period;          // Specifies the period value to be loaded into the Auto-Reload Register (ARR) at the next update event. This parameter must be a number between 0x0000 and 0xFFFFFFFF
        uint16_t TIMER_CounterMode;     // Specifies the counter mode. This parameter can be a value of @ref TIMER_Counter_Mode
        uint16_t TIMER_CounterDirection;// Specifies the counter direction. This parameter can be a value of @ref TIMER_Counter_Direction
        uint16_t TIMER_EventSource;     // Specifies the Counter Event source. This parameter can be a value of @ref TIMER_Event_Source
        uint16_t TIMER_FilterSampling;  // Specifies the filter sampling clock (FDTS). This parameter can be a value of @ref TIMER_Filter_Sampling
        uint16_t TIMER_ARR_UpdateMode;  // Specifies the Auto-Reload Register (ARR) updating mode. This parameter can be a value of @ref TIMER_ARR_Update_Mode
        uint16_t TIMER_ETR_FilterConf;  // Specifies the ETR Filter configuration. This parameter can be a value of @ref TIMER_FilterConfiguration
        uint16_t TIMER_ETR_Prescaler;   // Specifies the ETR Prescaler configuration. This parameter can be a value of @ref TIMER_ETR_Prescaler
        uint16_t TIMER_ETR_Polarity;    // Specifies the ETR Polarity configuration. This parameter can be a value of @ref TIMER_ETR_Polarity
        uint16_t TIMER_BRK_Polarity;    // Specifies the BRK Polarity configuration. This parameter can be a value of @ref TIMER_BRK_Polarity
} TIMER_CntInitTypeDef;

/***************************************************************************************************************/

// TIMER Channel Init structure definition
typedef struct
{
        uint16_t TIMER_CH_Number;               // Specifies the TIMER Channel number to be configured. This parameter can be a value of TIMER_CH_Number
        uint16_t TIMER_CH_Mode;                 // Specifies the TIMER Channel mode. This parameter can be a value of TIMER_CH_Mode
        uint16_t TIMER_CH_ETR_Ena;              // Enables or disables ETR. This parameter can be a value of FunctionalState
        uint16_t TIMER_CH_ETR_Reset;            // Enables or disables ETR Reset. This parameter can be a value of TIMER_CH_ETR_Reset
        uint16_t TIMER_CH_BRK_Reset;            // Enables or disables BRK Reset. This parameter can be a value of TIMER_CH_BRK_Reset
        uint16_t TIMER_CH_REF_Format;           // Specifies the REF signal format. This parameter can be a value of @ref TIMER_CH_REF_Format
        uint16_t TIMER_CH_Prescaler;            // Specifies the TIMER Channel Prescaler configuration. This parameter can be a value of TIMER_CH_Prescaler
        uint16_t TIMER_CH_EventSource;          // Specifies the Channel Event source. This parameter can be a value of TIMER_CH_EventSource
        uint16_t TIMER_CH_FilterConf;           // Specifies the TIMER Channel Filter configuration. This parameter can be a value of TIMER_FilterConfiguration
        uint16_t TIMER_CH_CCR_UpdateMode;       // Specifies the TIMER CCR, CCR1 update mode. This parameter can be a value of TIMER_CH_CCR_Update_Mode
        uint16_t TIMER_CH_CCR1_Ena;             // Enables or disables the CCR1 register. This parameter can be a value of FunctionalState
        uint16_t TIMER_CH_CCR1_EventSource;     // Specifies the Channel CCR1 Event source. This parameter can be a value of TIMER_CH_CCR1_EventSource
} TIMER_ChnInitTypeDef;

/***************************************************************************************************************/

// TIMER Channel Output Init structure definition
typedef struct
{
        uint16_t TIMER_CH_Number;               // Specifies the TIMER Channel number to be configured. This parameter can be a value of @ref TIMER_CH_Number
        uint16_t TIMER_CH_DirOut_Polarity;      // Specifies the TIMER CHx output polarity. This parameter can be a value of @ref TIMER_CH_OUT_Polarity
        uint16_t TIMER_CH_DirOut_Source;        // Specifies the TIMER CHx output source. This parameter can be a value of @ref TIMER_CH_OUT_Source
        uint16_t TIMER_CH_DirOut_Mode;          // Specifies the TIMER CHx output enable source. This parameter can be a value of @ref TIMER_CH_OUT_Mode
        uint16_t TIMER_CH_NegOut_Polarity;      // Enables or disables the TIMER CHxN output inversion. This parameter can be a value of @ref TIMER_CH_OUT_Polarity
        uint16_t TIMER_CH_NegOut_Source;        // Specifies the TIMER CHxN output source. This parameter can be a value of @ref TIMER_CH_OUT_Source
        uint16_t TIMER_CH_NegOut_Mode;          // Specifies the TIMER CHxN output enable source. This parameter can be a value of @ref TIMER_CH_OUT_Mode
        uint16_t TIMER_CH_DTG_MainPrescaler;    // Specifies the main prescaler of TIMER DTG. This parameter can be a number between 0x0000 and 0x00FF. Delay DTGdel = TIMER_CH_DTG_MainPrescaler*(TIMER_CH_DTG_AuxPrescaler + 1) clocks
        uint16_t TIMER_CH_DTG_AuxPrescaler;     // Specifies the auxiliary prescaler of TIMER DTG. This parameter can be a number between 0x0000 and 0x000F. Delay DTGdel = TIMER_CH_DTG_MainPrescaler*(TIMER_CH_DTG_AuxPrescaler + 1) clocks
        uint16_t TIMER_CH_DTG_ClockSource;      // Specifies the TIMER DTG clock source. This parameter can be a value of @ref TIMER_CH_DTG_Clock_Source
}TIMER_ChnOutInitTypeDef;

//
//
// End of group TIMER_Exported_Types
//
//

//
//
// TIMER_Exported_Constants TIMER Exported Constants
//
//

#define IS_TIMER_ALL_PERIPH(PERIPH) (((PERIPH) == MDR_TIMER1) || \
                                     ((PERIPH) == MDR_TIMER2) || \
                                     ((PERIPH) == MDR_TIMER3) || \
                                     ((PERIPH) == MDR_TIMER4))

/***************************************************************************************************************/

// TIMER_Counter_Mode TIMER Counter Mode
#define TIMER_CntMode_ClkFixedDir             (((uint32_t)0x0) << TIMER_CNTRL_CNT_MODE_Pos) // The Timer clock changes the TIMERx_CNT value. The count direction is not changed.
#define TIMER_CntMode_ClkChangeDir            (((uint32_t)0x1) << TIMER_CNTRL_CNT_MODE_Pos) // The Timer clock changes the TIMERx_CNT value. The count direction changes.
#define TIMER_CntMode_EvtFixedDir             (((uint32_t)0x2) << TIMER_CNTRL_CNT_MODE_Pos) // The event changes the TIMERx_CNT value. The count direction is not changed.
#define TIMER_CntMode_EvtChangeDir            (((uint32_t)0x3) << TIMER_CNTRL_CNT_MODE_Pos) // The event changes the TIMERx_CNT value. The count direction changes.

#define IS_TIMER_COUNTER_MODE(MODE) (((MODE) == TIMER_CntMode_ClkFixedDir ) || \
                                     ((MODE) == TIMER_CntMode_ClkChangeDir) || \
                                     ((MODE) == TIMER_CntMode_EvtFixedDir ) || \
                                     ((MODE) == TIMER_CntMode_EvtChangeDir))

