Winterviking/code_examples/uartled/INCLUDE/MDR1986VE1T_Add.h
// End of group TIMER_Counter_Mode

/***************************************************************************************************************/

// TIMER_Counter_Direction TIMER Counter Direction
#define TIMER_CntDir_Up                       (((uint32_t)0x0) << TIMER_CNTRL_DIR_Pos)  // Increments the Timer TIMERx_CNT counter value.
#define TIMER_CntDir_Dn                       (((uint32_t)0x1) << TIMER_CNTRL_DIR_Pos)  // Decrements the Timer TIMERx_CNT counter value.

#define IS_TIMER_COUNTER_DIR(DIR) (((DIR) == TIMER_CntDir_Up) || \
                                   ((DIR) == TIMER_CntDir_Dn))

// End of group TIMER_Counter_Direction

/***************************************************************************************************************/

// TIMER_Event_Source TIMER Event Source
#define TIMER_EvSrc_TM1                       (((uint32_t)0x1) << TIMER_CNTRL_EVENT_SEL_Pos)  // Selects TIMER1 (CNT == ARR) event.
#define TIMER_EvSrc_TM3                       (((uint32_t)0x3) << TIMER_CNTRL_EVENT_SEL_Pos)  // Selects TIMER3 (CNT == ARR) event.
#define TIMER_EvSrc_CH2                       (((uint32_t)0x5) << TIMER_CNTRL_EVENT_SEL_Pos)  // Selects Channel 2 event.
#define TIMER_EvSrc_CH4                       (((uint32_t)0x7) << TIMER_CNTRL_EVENT_SEL_Pos)  // Selects Channel 4 event.

#define IS_TIMER_EVENT_SOURCE(SOURCE) (((SOURCE) == TIMER_EvSrc_None) || \
                                       ((SOURCE) == TIMER_EvSrc_TM1 ) || \
                                       ((SOURCE) == TIMER_EvSrc_TM2 ) || \
                                       ((SOURCE) == TIMER_EvSrc_TM3 ) || \
                                       ((SOURCE) == TIMER_EvSrc_CH1 ) || \
                                       ((SOURCE) == TIMER_EvSrc_CH2 ) || \
                                       ((SOURCE) == TIMER_EvSrc_CH3 ) || \
                                       ((SOURCE) == TIMER_EvSrc_CH4 ) || \
                                       ((SOURCE) == TIMER_EvSrc_ETR ))

// End of group TIMER_Event_Source

/***************************************************************************************************************/

// TIMER_Filter_Sampling TIMER Filter Sampling Clock
#define TIMER_FDTS_TIMER_CLK_div_1              (((uint32_t)0x0) << TIMER_CNTRL_FDTS_Pos) // The FDTS clock occures each TIMER_CLK clock.
#define TIMER_FDTS_TIMER_CLK_div_2              (((uint32_t)0x1) << TIMER_CNTRL_FDTS_Pos) // The FDTS clock occures each 2-nd TIMER_CLK clock.
#define TIMER_FDTS_TIMER_CLK_div_3              (((uint32_t)0x2) << TIMER_CNTRL_FDTS_Pos) // The FDTS clock occures each 3-rd TIMER_CLK clock.
#define TIMER_FDTS_TIMER_CLK_div_4              (((uint32_t)0x3) << TIMER_CNTRL_FDTS_Pos) // The FDTS clock occures each 4-th TIMER_CLK clock.

#define IS_TIMER_FILTER_SAMPLING(CONFIG) (((CONFIG) == TIMER_FDTS_TIMER_CLK_div_1) || \
                                          ((CONFIG) == TIMER_FDTS_TIMER_CLK_div_2) || \
                                          ((CONFIG) == TIMER_FDTS_TIMER_CLK_div_3) || \
                                          ((CONFIG) == TIMER_FDTS_TIMER_CLK_div_4))

// End of group TIMER_Filter_Sampling

/***************************************************************************************************************/

// TIMER_ARR_Update_Mode TIMER ARR Update Mode
#define TIMER_ARR_Update_Immediately          (((uint32_t)0x0) << TIMER_CNTRL_ARRB_EN_Pos)  // The ARR register is updated immediately.
#define TIMER_ARR_Update_On_CNT_Overflow      (((uint32_t)0x1) << TIMER_CNTRL_ARRB_EN_Pos)  // The ARR register is updated at CNT count end.

#define IS_TIMER_ARR_UPDATE_MODE(MODE) (((MODE) == TIMER_ARR_Update_Immediately    ) || \
                                        ((MODE) == TIMER_ARR_Update_On_CNT_Overflow))

// End of group TIMER_ARR_UpdateMode

/***************************************************************************************************************/

// TIMER_FilterConfiguration TIMER Filter configuration
#define TIMER_Filter_1FF_at_TIMER_CLK         ((uint32_t)0x0)  // Signal is latched by 1 trigger  at TIMER_CLK clock frequency.
#define TIMER_Filter_2FF_at_TIMER_CLK         ((uint32_t)0x1)  // Signal is latched by 2 triggers at TIMER_CLK clock frequency.
#define TIMER_Filter_4FF_at_TIMER_CLK         ((uint32_t)0x2)  // Signal is latched by 4 triggers at TIMER_CLK clock frequency.
#define TIMER_Filter_8FF_at_TIMER_CLK         ((uint32_t)0x3)  // Signal is latched by 8 triggers at TIMER_CLK clock frequency.
#define TIMER_Filter_6FF_at_FTDS_div_2        ((uint32_t)0x4)  // Signal is latched by 6 triggers at FDTS/2  clock frequency.
#define TIMER_Filter_8FF_at_FTDS_div_2        ((uint32_t)0x5)  // Signal is latched by 8 triggers at FDTS/2  clock frequency.
#define TIMER_Filter_6FF_at_FTDS_div_4        ((uint32_t)0x6)  // Signal is latched by 6 triggers at FDTS/4  clock frequency.
#define TIMER_Filter_8FF_at_FTDS_div_4        ((uint32_t)0x7)  // Signal is latched by 8 triggers at FDTS/4  clock frequency.
#define TIMER_Filter_6FF_at_FTDS_div_8        ((uint32_t)0x8)  // Signal is latched by 6 triggers at FDTS/8  clock frequency.
#define TIMER_Filter_8FF_at_FTDS_div_8        ((uint32_t)0x9)  // Signal is latched by 8 triggers at FDTS/8  clock frequency.
#define TIMER_Filter_5FF_at_FTDS_div_16       ((uint32_t)0xA)  // Signal is latched by 5 triggers at FDTS/16 clock frequency.
#define TIMER_Filter_6FF_at_FTDS_div_16       ((uint32_t)0xB)  // Signal is latched by 6 triggers at FDTS/16 clock frequency.
#define TIMER_Filter_8FF_at_FTDS_div_16       ((uint32_t)0xC)  // Signal is latched by 8 triggers at FDTS/16 clock frequency.
#define TIMER_Filter_5FF_at_FTDS_div_32       ((uint32_t)0xD)  // Signal is latched by 5 triggers at FDTS/32 clock frequency.
#define TIMER_Filter_6FF_at_FTDS_div_32       ((uint32_t)0xE)  // Signal is latched by 6 triggers at FDTS/32 clock frequency.
#define TIMER_Filter_8FF_at_FTDS_div_32       ((uint32_t)0xF)  // Signal is latched by 8 triggers at FDTS/32 clock frequency.

#define IS_TIMER_FILTER_CONF(CONF) (((CONF) == TIMER_Filter_1FF_at_TIMER_CLK  ) || \
                                    ((CONF) == TIMER_Filter_2FF_at_TIMER_CLK  ) || \
                                    ((CONF) == TIMER_Filter_4FF_at_TIMER_CLK  ) || \
                                    ((CONF) == TIMER_Filter_8FF_at_TIMER_CLK  ) || \
                                    ((CONF) == TIMER_Filter_6FF_at_FTDS_div_2 ) || \
                                    ((CONF) == TIMER_Filter_8FF_at_FTDS_div_2 ) || \
                                    ((CONF) == TIMER_Filter_6FF_at_FTDS_div_4 ) || \
                                    ((CONF) == TIMER_Filter_8FF_at_FTDS_div_4 ) || \
                                    ((CONF) == TIMER_Filter_6FF_at_FTDS_div_8 ) || \
                                    ((CONF) == TIMER_Filter_8FF_at_FTDS_div_8 ) || \
                                    ((CONF) == TIMER_Filter_5FF_at_FTDS_div_16) || \
                                    ((CONF) == TIMER_Filter_6FF_at_FTDS_div_16) || \
                                    ((CONF) == TIMER_Filter_8FF_at_FTDS_div_16) || \
                                    ((CONF) == TIMER_Filter_5FF_at_FTDS_div_32) || \
                                    ((CONF) == TIMER_Filter_6FF_at_FTDS_div_32) || \
                                    ((CONF) == TIMER_Filter_8FF_at_FTDS_div_32))

// End of group TIMER_FilterConfiguration

/***************************************************************************************************************/

// TIMER_ETR_Prescaler TIMER ETR Prescaler
#define TIMER_ETR_Prescaler_None              (((uint32_t)0x0) << TIMER_BRKETR_CNTRL_ETR_PSC_Pos)  // No division of input frequency.
#define TIMER_ETR_Prescaler_div_2             (((uint32_t)0x1) << TIMER_BRKETR_CNTRL_ETR_PSC_Pos)  // Selects input frequency divider by 2.
#define TIMER_ETR_Prescaler_div_4             (((uint32_t)0x2) << TIMER_BRKETR_CNTRL_ETR_PSC_Pos)  // Selects input frequency divider by 4.
#define TIMER_ETR_Prescaler_div_8             (((uint32_t)0x3) << TIMER_BRKETR_CNTRL_ETR_PSC_Pos)  // Selects input frequency divider by 8.

#define IS_TIMER_ETR_PRESCALER(VALUE) (((VALUE) == TIMER_ETR_Prescaler_None ) || \
                                       ((VALUE) == TIMER_ETR_Prescaler_div_2) || \
                                       ((VALUE) == TIMER_ETR_Prescaler_div_4) || \
                                       ((VALUE) == TIMER_ETR_Prescaler_div_8))

// End of group TIMER_ETR_Prescaler

/***************************************************************************************************************/

// TIMER_ETR_Polarity TIMER ETR Polarity
#define TIMER_ETRPolarity_NonInverted         (((uint32_t)0x0) << TIMER_BRKETR_CNTRL_ETR_INV_Pos)  // No inversion of the ETR input.
#define TIMER_ETRPolarity_Inverted            (((uint32_t)0x1) << TIMER_BRKETR_CNTRL_ETR_INV_Pos)  // The ETR input is inverted.

