Winterviking/code_examples/uartled/INCLUDE/MDR1986VE1T_Add.h
#define IS_TIMER_ETR_POLARITY(STATE) (((STATE) == TIMER_ETRPolarity_NonInverted) || \
                                      ((STATE) == TIMER_ETRPolarity_Inverted   ))

// End of group TIMER_ETR_Polarity

/***************************************************************************************************************/

// TIMER_BRK_Polarity TIMER BRK Polarity
#define TIMER_BRKPolarity_NonInverted         (((uint32_t)0x0) << TIMER_BRKETR_CNTRL_BRK_INV_Pos)  // No inversion of the BRK input.
#define TIMER_BRKPolarity_Inverted            (((uint32_t)0x1) << TIMER_BRKETR_CNTRL_BRK_INV_Pos)  // The BRK input is inverted.

#define IS_TIMER_BRK_POLARITY(STATE) (((STATE) == TIMER_BRKPolarity_NonInverted) || \
                                      ((STATE) == TIMER_BRKPolarity_Inverted   ))

// End of group TIMER_BRK_Polarity

/***************************************************************************************************************/

// TIMER_CH_Number TIMER Channel Number
#define TIMER_CHANNEL1                        ((uint32_t)0x0)  // Specifies the TIMER channel 1.
#define TIMER_CHANNEL2                        ((uint32_t)0x1)  // Specifies the TIMER channel 2.
#define TIMER_CHANNEL3                        ((uint32_t)0x2)  // Specifies the TIMER channel 3.
#define TIMER_CHANNEL4                        ((uint32_t)0x3)  // Specifies the TIMER channel 4.

#define IS_TIMER_CHANNEL_NUMBER(NUMBER) (((NUMBER) == TIMER_CHANNEL1) || \
                                         ((NUMBER) == TIMER_CHANNEL2) || \
                                         ((NUMBER) == TIMER_CHANNEL3) || \
                                         ((NUMBER) == TIMER_CHANNEL4))

// End of group TIMER_CH_Number

/***************************************************************************************************************/

// TIMER_CH_ETR_Reset TIMER Channel ETR Reset configuration
#define TIMER_CH_ETR_RESET_Disable            (((uint32_t)0x0) << TIMER_CH_CNTRL_ETREN_Pos)  // Disables ETR Reset.
#define TIMER_CH_ETR_RESET_Enable             (((uint32_t)0x1) << TIMER_CH_CNTRL_ETREN_Pos)  // Enables ETR Reset.

#define IS_TIMER_CHANNEL_ETR_RESET_CONFIG(CONFIG) (((CONFIG) == TIMER_CH_ETR_RESET_Disable) || \
                                                   ((CONFIG) == TIMER_CH_ETR_RESET_Enable ))

// End of group TIMER_CH_ETR_Reset

/***************************************************************************************************************/

// TIMER_CH_BRK_Reset TIMER Channel BRK Reset configuration
#define TIMER_CH_BRK_RESET_Disable            (((uint32_t)0x0) << TIMER_CH_CNTRL_BRKEN_Pos)   // Disables BRK Reset.
#define TIMER_CH_BRK_RESET_Enable             (((uint32_t)0x1) << TIMER_CH_CNTRL_BRKEN_Pos)   // Enables BRK Reset. /

#define IS_TIMER_CHANNEL_BRK_RESET_CONFIG(CONFIG) (((CONFIG) == TIMER_CH_BRK_RESET_Disable) || \
                                                   ((CONFIG) == TIMER_CH_BRK_RESET_Enable ))

// End of group TIMER_CH_BRK_Reset

/***************************************************************************************************************/

// TIMER_CH_Mode TIMER Channel Mode
#define TIMER_CH_MODE_PWM                     (((uint32_t)0x0) << TIMER_CH_CNTRL_CAP_NPWM_Pos)  // Specifies the PWM channel mode.
#define TIMER_CH_MODE_CAPTURE                 (((uint32_t)0x1) << TIMER_CH_CNTRL_CAP_NPWM_Pos)  // Specifies the Capture channel mode.
#define IS_TIMER_CHANNEL_MODE(MODE) (((MODE) == TIMER_CH_MODE_PWM    ) || \
                                     ((MODE) == TIMER_CH_MODE_CAPTURE))
// End of group TIMER_CH_Mode

/***************************************************************************************************************/

// TIMER_CH_REF_Format TIMER Channel REF Format
#define TIMER_CH_REF_Format0                  (((uint32_t)0x0) << TIMER_CH_CNTRL_OCCM_Pos)  // REF is equal to 0
#define TIMER_CH_REF_Format1                  (((uint32_t)0x1) << TIMER_CH_CNTRL_OCCM_Pos)  // REF is equal to 1 if: (CNT == CCR) or ((CNT == CCR1) and CCR1 enabled), else REF is equal to 0.
#define TIMER_CH_REF_Format2                  (((uint32_t)0x2) << TIMER_CH_CNTRL_OCCM_Pos)  // REF is equal to 0 if: (CNT == CCR) or ((CNT == CCR1) and CCR1 enabled), else REF is equal to 1.
#define TIMER_CH_REF_Format3                  (((uint32_t)0x3) << TIMER_CH_CNTRL_OCCM_Pos)  // Toggle REF state if:  (CNT == CCR) or ((CNT == CCR1) and CCR1 enabled).
#define TIMER_CH_REF_Format4                  (((uint32_t)0x4) << TIMER_CH_CNTRL_OCCM_Pos)  // REF is equal to 0.
#define TIMER_CH_REF_Format5                  (((uint32_t)0x5) << TIMER_CH_CNTRL_OCCM_Pos)  // REF is equal to 1.
#define TIMER_CH_REF_Format6                  (((uint32_t)0x6) << TIMER_CH_CNTRL_OCCM_Pos)  // REF is equal to inverted DIR state if: (CCR1 disabled and (CNT < CCR)) or (CCR1 enabled  and (CCR1 < CNT < CCR)), else REF is equal to DIR state.
#define TIMER_CH_REF_Format7                  (((uint32_t)0x7) << TIMER_CH_CNTRL_OCCM_Pos)  // REF is equal to DIR state if: (CCR1 disabled and (CNT < CCR)) or (CCR1 enabled  and (CCR1 < CNT < CCR)), else REF is equal to inverted DIR state.

#define IS_TIMER_CHANNEL_REF_FORMAT(FORMAT) (((FORMAT) == TIMER_CH_REF_Format0) || \
                                             ((FORMAT) == TIMER_CH_REF_Format1) || \
                                             ((FORMAT) == TIMER_CH_REF_Format2) || \
                                             ((FORMAT) == TIMER_CH_REF_Format3) || \
                                             ((FORMAT) == TIMER_CH_REF_Format4) || \
                                             ((FORMAT) == TIMER_CH_REF_Format5) || \
                                             ((FORMAT) == TIMER_CH_REF_Format6) || \
                                             ((FORMAT) == TIMER_CH_REF_Format7))

// End of group TIMER_CH_REF_Format

/***************************************************************************************************************/

// TIMER_CH_Prescaler TIMER Channel Prescaler
#define TIMER_CH_Prescaler_None               ((uint32_t)0x0) // No division of input frequency.
#define TIMER_CH_Prescaler_div_2              ((uint32_t)0x1) // Selects input frequency divider by 2.
#define TIMER_CH_Prescaler_div_4              ((uint32_t)0x2) // Selects input frequency divider by 4.
#define TIMER_CH_Prescaler_div_8              ((uint32_t)0x3) // Selects input frequency divider by 8.

#define IS_TIMER_CHANNEL_PRESCALER(VALUE) (((VALUE) == TIMER_CH_Prescaler_None ) || \
                                           ((VALUE) == TIMER_CH_Prescaler_div_2) || \
                                           ((VALUE) == TIMER_CH_Prescaler_div_4) || \
                                           ((VALUE) == TIMER_CH_Prescaler_div_8))

// End of group TIMER_CH_Prescaler

// TIMER_CH_EventSource TIMER Channel Event Source
#define TIMER_CH_EvSrc_PE                     (((uint32_t)0x0) << TIMER_CH_CNTRL_CHSEL_Pos)  // Selects positive edge from current TIMER channel.
#define TIMER_CH_EvSrc_NE                     (((uint32_t)0x1) << TIMER_CH_CNTRL_CHSEL_Pos)  // Selects negative edge from current TIMER channel.
#define TIMER_CH_EvSrc_PE_OC1                 (((uint32_t)0x2) << TIMER_CH_CNTRL_CHSEL_Pos)  // Selects positive edge from other TIMER channel (variant 1).
#define TIMER_CH_EvSrc_PE_OC2                 (((uint32_t)0x3) << TIMER_CH_CNTRL_CHSEL_Pos)  // Selects positive edge from other TIMER channel (variant 2).

