Winterviking/code_examples/uartled/INCLUDE/MDR1986VE1T_Add.h
#define IS_TIMER_CHANNEL_EVENT_SOURCE(SOURCE) (((SOURCE) == TIMER_CH_EvSrc_PE    ) || \
                                               ((SOURCE) == TIMER_CH_EvSrc_NE    ) || \
                                               ((SOURCE) == TIMER_CH_EvSrc_PE_OC1) || \
                                               ((SOURCE) == TIMER_CH_EvSrc_PE_OC2))

// End of group TIMER_CH_EventSource

/***************************************************************************************************************/

// TIMER_CH_CCR1_EventSource TIMER Channel CCR1 Event Source
#define TIMER_CH_CCR1EvSrc_PE                 (((uint32_t)0x0) << TIMER_CH_CNTRL2_CHSEL1_Pos) // Selects positive edge from current TIMER channel.
#define TIMER_CH_CCR1EvSrc_NE                 (((uint32_t)0x1) << TIMER_CH_CNTRL2_CHSEL1_Pos) // Selects negative edge from current TIMER channel.
#define TIMER_CH_CCR1EvSrc_NE_OC1             (((uint32_t)0x2) << TIMER_CH_CNTRL2_CHSEL1_Pos) // Selects negative edge from other TIMER channel (variant 1).
#define TIMER_CH_CCR1EvSrc_NE_OC2             (((uint32_t)0x3) << TIMER_CH_CNTRL2_CHSEL1_Pos) // Selects negative edge from other TIMER channel (variant 2).

#define IS_TIMER_CHANNEL_CCR1_EVENT_SOURCE(SOURCE) (((SOURCE) == TIMER_CH_CCR1EvSrc_PE    ) || \
                                                    ((SOURCE) == TIMER_CH_CCR1EvSrc_NE    ) || \
                                                    ((SOURCE) == TIMER_CH_CCR1EvSrc_NE_OC1) || \
                                                    ((SOURCE) == TIMER_CH_CCR1EvSrc_NE_OC2))

// End of group TIMER_CH_CCR1_EventSource

/***************************************************************************************************************/

// TIMER_CH_CCR_Update_Mode TIMER CCR, CCR1 Update mode
#define TIMER_CH_CCR_Update_Immediately       (((uint32_t)0x0) << TIMER_CH_CNTRL2_CCRRLD_Pos)  // The CCR, CCR1 registers is updated immediately.
#define TIMER_CH_CCR_Update_On_CNT_eq_0       (((uint32_t)0x1) << TIMER_CH_CNTRL2_CCRRLD_Pos)  // The CCR, CCR1 registers is updated at (CNT == 0) condition.

#define IS_TIMER_CHANNEL_CCR_UPDATE_MODE(MODE) (((MODE) == TIMER_CH_CCR_Update_Immediately) || \
                                                ((MODE) == TIMER_CH_CCR_Update_On_CNT_eq_0))

// End of group TIMER_CH_CCR_UpdateMode

/***************************************************************************************************************/

// TIMER_CH_OUT_Polarity TIMER Channel Output Polarity
#define TIMER_CHOPolarity_NonInverted         ((uint32_t)0x0)   // No inversion on the Channel output.
#define TIMER_CHOPolarity_Inverted            ((uint32_t)0x1)   // The Channel output is inverted.

#define IS_TIMER_CHO_POLARITY(STATE) (((STATE) == TIMER_CHOPolarity_NonInverted) || \
                                      ((STATE) == TIMER_CHOPolarity_Inverted   ))

// End of group TIMER_CH_OUT_Polarity

/***************************************************************************************************************/

// TIMER_CH_OUT_Source TIMER Channel Output Source
#define TIMER_CH_OutSrc_Only_0                ((uint32_t)0x0)   // Selects the '0' state on the CHx (or CHxN) line.
#define TIMER_CH_OutSrc_Only_1                ((uint32_t)0x1)   // Selects the '1' state on the CHx (or CHxN) line.
#define TIMER_CH_OutSrc_REF                   ((uint32_t)0x2)   // Selects the REF state on the CHx (or CHxN) line.
#define TIMER_CH_OutSrc_DTG                   ((uint32_t)0x3)   // Selects the DTG output state on the CHx (or CHxN) line.

#define IS_TIMER_CHO_SOURCE(SOURCE) (((SOURCE) == TIMER_CH_OutSrc_Only_0) || \
                                     ((SOURCE) == TIMER_CH_OutSrc_Only_1) || \
                                     ((SOURCE) == TIMER_CH_OutSrc_REF   ) || \
                                     ((SOURCE) == TIMER_CH_OutSrc_DTG   ))

// End of group TIMER_CH_OUT_Source

/***************************************************************************************************************/

// TIMER_CH_OUT_Mode TIMER Channel Output Enable Source
#define TIMER_CH_OutMode_Input                ((uint32_t)0x0)   // Selects the Input mode on the CHx (or CHxN) line.
#define TIMER_CH_OutMode_Output               ((uint32_t)0x1)   // Selects the Output mode on the CHx (or CHxN) line.
#define TIMER_CH_OutMode_REF_as_OE            ((uint32_t)0x2)   // The REF signal specifies the CHx (or CHxN) line mode.
#define TIMER_CH_OutMode_DTG_as_OE            ((uint32_t)0x3)   // The DTG output specifies the CHx (or CHxN) line mode.

#define IS_TIMER_CHO_MODE(MODE) (((MODE) == TIMER_CH_OutMode_Input    ) || \
                                 ((MODE) == TIMER_CH_OutMode_Output   ) || \
                                 ((MODE) == TIMER_CH_OutMode_REF_as_OE) || \
                                 ((MODE) == TIMER_CH_OutMode_DTG_as_OE))

// End of group TIMER_CH_OUT_Mode

/***************************************************************************************************************/

// TIMER_CH_DTG_Prescaler TIMER Channel DTG Prescaler
#define IS_TIMER_CHANNEL_DTG_MAIN_PRESCALER(VALUE) (((VALUE) >> 8) == 0)

#define IS_TIMER_CHANNEL_DTG_AUX_PRESCALER(VALUE) (((VALUE) >> 4) == 0)

// End of group TIMER_CH_DTG_Prescaler

/***************************************************************************************************************/

// TIMER_CH_DTG_Clock_Source TIMER Channel DTG Clock Source
#define TIMER_CH_DTG_ClkSrc_TIMER_CLK         (((uint32_t)0x0) << TIMER_CH_DTG_EDTS_Pos)  // Specifies the TIMER_CLK signal as DTG clock source.
#define TIMER_CH_DTG_ClkSrc_FDTS              (((uint32_t)0x1) << TIMER_CH_DTG_EDTS_Pos)  // Specifies the FDTS signal as DTG clock source.

#define IS_TIMER_CHANNEL_DTG_CLK_SOURCE(SOURCE) (((SOURCE) == TIMER_CH_DTG_ClkSrc_TIMER_CLK) || \
                                                 ((SOURCE) == TIMER_CH_DTG_ClkSrc_FDTS     ))

// End of group TIMER_CH_DTG_Clock_Source

/***************************************************************************************************************/

// TIMER_StatusFlags TIMER Status flags
#define TIMER_STATUS_CNT_ZERO                 (((uint32_t)0x1) <<  0) // The (CNT == 0) condition occured.
#define TIMER_STATUS_CNT_ARR                  (((uint32_t)0x1) <<  1) // The (CNT == ARR) condition occured.
#define TIMER_STATUS_ETR_RISING_EDGE          (((uint32_t)0x1) <<  2) // The ETR rising edge occured.
#define TIMER_STATUS_ETR_FALLING_EDGE         (((uint32_t)0x1) <<  3) // The ETR falling edge occured.
#define TIMER_STATUS_BRK                      (((uint32_t)0x1) <<  4) // The (BRK == 1) condition occured.
#define TIMER_STATUS_CCR_CAP_CH1              (((uint32_t)0x1) <<  5) // The Channel 1 CCR capture condition occured.
#define TIMER_STATUS_CCR_CAP_CH2              (((uint32_t)0x1) <<  6) // The Channel 2 CCR capture condition occured.
#define TIMER_STATUS_CCR_CAP_CH3              (((uint32_t)0x1) <<  7) // The Channel 3 CCR capture condition occured.
#define TIMER_STATUS_CCR_CAP_CH4              (((uint32_t)0x1) <<  8) // The Channel 4 CCR capture condition occured.
#define TIMER_STATUS_CCR_REF_CH1              (((uint32_t)0x1) <<  9) // The Channel 1 (REF == 1) condition occured.
#define TIMER_STATUS_CCR_REF_CH2              (((uint32_t)0x1) << 10) // The Channel 2 (REF == 1) condition occured.
#define TIMER_STATUS_CCR_REF_CH3              (((uint32_t)0x1) << 11) // The Channel 3 (REF == 1) condition occured.
#define TIMER_STATUS_CCR_REF_CH4              (((uint32_t)0x1) << 12) // The Channel 4 (REF == 1) condition occured.
#define TIMER_STATUS_CCR_CAP1_CH1             (((uint32_t)0x1) << 13) // The Channel 1 CCR1 capture condition occured.
#define TIMER_STATUS_CCR_CAP1_CH2             (((uint32_t)0x1) << 14) // The Channel 2 CCR1 capture condition occured.
#define TIMER_STATUS_CCR_CAP1_CH3             (((uint32_t)0x1) << 15) // The Channel 3 CCR1 capture condition occured.
#define TIMER_STATUS_CCR_CAP1_CH4             (((uint32_t)0x1) << 16) // The Channel 4 CCR1 capture condition occured.

#define TIMER_STATUS_Msk                      (TIMER_STATUS_CNT_ZERO         | \
                                               TIMER_STATUS_CNT_ARR          | \
                                               TIMER_STATUS_ETR_RISING_EDGE  | \
                                               TIMER_STATUS_ETR_FALLING_EDGE | \
                                               TIMER_STATUS_BRK              | \
                                               TIMER_STATUS_CCR_CAP_CH1      | \
                                               TIMER_STATUS_CCR_CAP_CH2      | \
                                               TIMER_STATUS_CCR_CAP_CH3      | \
                                               TIMER_STATUS_CCR_CAP_CH4      | \
                                               TIMER_STATUS_CCR_REF_CH1      | \
                                               TIMER_STATUS_CCR_REF_CH2      | \
                                               TIMER_STATUS_CCR_REF_CH3      | \
                                               TIMER_STATUS_CCR_REF_CH4      | \
                                               TIMER_STATUS_CCR_CAP1_CH1     | \
                                               TIMER_STATUS_CCR_CAP1_CH2     | \
                                               TIMER_STATUS_CCR_CAP1_CH3     | \
                                               TIMER_STATUS_CCR_CAP1_CH4)

#define IS_TIMER_STATUS_FLAG(FLAG) (((FLAG) == TIMER_STATUS_CNT_ZERO        ) || \
                                    ((FLAG) == TIMER_STATUS_CNT_ARR         ) || \
                                    ((FLAG) == TIMER_STATUS_ETR_RISING_EDGE ) || \
                                    ((FLAG) == TIMER_STATUS_ETR_FALLING_EDGE) || \
                                    ((FLAG) == TIMER_STATUS_BRK             ) || \
                                    ((FLAG) == TIMER_STATUS_CCR_CAP_CH1     ) || \
                                    ((FLAG) == TIMER_STATUS_CCR_CAP_CH2     ) || \
                                    ((FLAG) == TIMER_STATUS_CCR_CAP_CH3     ) || \
                                    ((FLAG) == TIMER_STATUS_CCR_CAP_CH4     ) || \
                                    ((FLAG) == TIMER_STATUS_CCR_REF_CH1     ) || \
                                    ((FLAG) == TIMER_STATUS_CCR_REF_CH2     ) || \
                                    ((FLAG) == TIMER_STATUS_CCR_REF_CH3     ) || \
                                    ((FLAG) == TIMER_STATUS_CCR_REF_CH4     ) || \
                                    ((FLAG) == TIMER_STATUS_CCR_CAP1_CH1    ) || \
                                    ((FLAG) == TIMER_STATUS_CCR_CAP1_CH2    ) || \
                                    ((FLAG) == TIMER_STATUS_CCR_CAP1_CH3    ) || \
                                    ((FLAG) == TIMER_STATUS_CCR_CAP1_CH4    ))

#define IS_TIMER_STATUS(STATUS) (((STATUS) & TIMER_STATUS_Msk) == (STATUS))

