Winterviking/code_examples/uartled/INCLUDE/MDR1986VE1T_Add.h
// End of group TIMER_StatusFlags

/***************************************************************************************************************/

// TIMER_DMAChannels TIMER DMAChannels
#define TIMER_DMA_Channel0                                      ((uint32_t)0x00000004)
#define TIMER_DMA_Channel1                                      ((uint32_t)0x00000000)
#define TIMER_DMA_Channel2                                      ((uint32_t)0x00000001)
#define TIMER_DMA_Channel3                                      ((uint32_t)0x00000002)
#define TIMER_DMA_Channel4                                      ((uint32_t)0x00000003)

#define IS_TIMER_DMA_Channel(DMA_Channel)       ((DMA_Channel == TIMER_DMA_Channel0) ||\
                                                 (DMA_CHannel == TIMER_DMA_Channel1) ||\
                                                 (DMA_CHannel == TIMER_DMA_Channel2) ||\
                                                 (DMA_CHannel == TIMER_DMA_Channel3) ||\
                                                 (DMA_CHannel == TIMER_DMA_Channel4))

// End of group TIMER_DMAChannels

/***************************************************************************************************************/

// TIMER_Clock_BRG TIMER Clock BRG
#define TIMER_HCLKdiv1                        ((uint32_t)0x0)
#define TIMER_HCLKdiv2                        ((uint32_t)0x1)
#define TIMER_HCLKdiv4                        ((uint32_t)0x2)
#define TIMER_HCLKdiv8                        ((uint32_t)0x3)
#define TIMER_HCLKdiv16                       ((uint32_t)0x4)
#define TIMER_HCLKdiv32                       ((uint32_t)0x5)
#define TIMER_HCLKdiv64                       ((uint32_t)0x6)
#define TIMER_HCLKdiv128                      ((uint32_t)0x7)

#define IS_TIMER_CLOCK_BRG(BRG) (((BRG) == TIMER_HCLKdiv1  ) || \
                                 ((BRG) == TIMER_HCLKdiv2  ) || \
                                 ((BRG) == TIMER_HCLKdiv4  ) || \
                                 ((BRG) == TIMER_HCLKdiv8  ) || \
                                 ((BRG) == TIMER_HCLKdiv16 ) || \
                                 ((BRG) == TIMER_HCLKdiv32 ) || \
                                 ((BRG) == TIMER_HCLKdiv64 ) || \
                                 ((BRG) == TIMER_HCLKdiv128))

// End of group TIMER_Clock_BRG

//
//
// End of group TIMER_Exported_Constants
//
//


































/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
// Convertion :::: FILE MDR32F9Qx_uart.h /******************************DONE-100%*******************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/

//
//
// UART_Exported_Types UART Exported Types
//
//

typedef enum {BaudRateInvalid = 0, BaudRateValid = !BaudRateInvalid} BaudRateStatus;

/***************************************************************************************************************/

// UART Init Structure definition
typedef struct
{
  uint32_t UART_BaudRate;            // This member configures the UART communication baud rate. The baud rate is computed using the following formula:
                                     //      - IntegerDivider = ((UARTCLK) / (16 * (UART_InitStruct->UART_BaudRate)))
                                     //      - FractionalDivider = ((IntegerDivider - ((u32) IntegerDivider)) * 64) + 0.5
  uint16_t UART_WordLength;          // Specifies the number of data bits transmitted or received in a frame. This parameter is one of @ref UART_Word_Length values.
  uint16_t UART_StopBits;            // Specifies the number of stop bits transmitted. This parameter is one of @ref UART_Stop_Bits values.
  uint16_t UART_Parity;              // Specifies the parity mode. This parameter is one of @ref UART_Parity values.
  uint16_t UART_FIFOMode;            // Specifies the FIFO mode. This parameter is one of @ref UART_FIFO_Mode values.
  uint16_t UART_HardwareFlowControl; // Specifies whether the hardware flow control mode is enabled or disabled. This parameter is one of @ref UART_Hardware_Flow_Control values.
}UART_InitTypeDef;

//
//
// End of group UART_Exported_Types
//
//

//
//
// UART_Exported_Constants UART Exported Constants
//
//

// UART_Word_Length UART Word Length
#define UART_WordLength5b                   ((uint16_t)0x0000)
#define UART_WordLength6b                   ((uint16_t)0x0020)
#define UART_WordLength7b                   ((uint16_t)0x0040)
#define UART_WordLength8b                   ((uint16_t)0x0060)

#define IS_UART_WORD_LENGTH(LENGTH)         (((LENGTH) == UART_WordLength5b) || \
                                             ((LENGTH) == UART_WordLength6b) || \
                                             ((LENGTH) == UART_WordLength7b) || \
                                             ((LENGTH) == UART_WordLength8b))

// End of group UART_Word_Length

/***************************************************************************************************************/

// UART_Stop_Bits UART Stop Bits
#define UART_StopBits1                      ((uint16_t)0x0000)
#define UART_StopBits2                      ((uint16_t)0x0008)

#define IS_UART_STOPBITS(STOPBITS)          (((STOPBITS) == UART_StopBits1) || \
                                             ((STOPBITS) == UART_StopBits2))

// End of group UART_Stop_Bits

/***************************************************************************************************************/

// UART_Parity UART Parity
#define UART_Parity_No                      ((uint16_t)0x0000)
#define UART_Parity_Even                    ((uint16_t)0x0006)
#define UART_Parity_Odd                     ((uint16_t)0x0002)
#define UART_Parity_1                       ((uint16_t)0x0082)
#define UART_Parity_0                       ((uint16_t)0x0086)

#define IS_UART_PARITY(PARITY)              (((PARITY) == UART_Parity_No)   || \
                                             ((PARITY) == UART_Parity_Even) || \
                                             ((PARITY) == UART_Parity_Odd)  || \
                                             ((PARITY) == UART_Parity_1)    || \
                                             ((PARITY) == UART_Parity_0))

// End of group UART_Parity

/***************************************************************************************************************/

// UART_FIFO_Mode UART FIFO Mode
#define UART_FIFO_OFF                       ((uint16_t)0x0000)
#define UART_FIFO_ON                        ((uint16_t)0x0010)

#define IS_UART_FIFOMODE(FIFOMODE)          (((FIFOMODE) == UART_FIFO_ON) || \
                                             ((FIFOMODE) == UART_FIFO_OFF))

// End of group UART_FIFO_Mode

/***************************************************************************************************************/

