Winterviking/code_examples/uartled/INCLUDE/MDR1986VE1T_Add.h
#define IS_UART_DATA(DATA)                  ((DATA) <= 0xFF)

// End of group UART_Data_Status

/***************************************************************************************************************/

// UART_Clock_BRG UART Clock BRG
#define UART_HCLKdiv1                       ((uint32_t)0x00000000)
#define UART_HCLKdiv2                       ((uint32_t)0x00000001)
#define UART_HCLKdiv4                       ((uint32_t)0x00000002)
#define UART_HCLKdiv8                       ((uint32_t)0x00000003)
#define UART_HCLKdiv16                      ((uint32_t)0x00000004)
#define UART_HCLKdiv32                      ((uint32_t)0x00000005)
#define UART_HCLKdiv64                      ((uint32_t)0x00000006)
#define UART_HCLKdiv128                     ((uint32_t)0x00000007)

#define IS_UART_CLOCK_BRG(BRG)              (((BRG) >= 0) && ((BRG) <= 7))

// End of group UART_Clock_BRG

//
//
// End of group UART_Exported_Constants
//
//

// from file uart.c
#define CR_EN_Set                 ((uint16_t)0x0001)  // UART Enable Mask
#define CR_EN_Reset               ((uint16_t)0xFFFE)  // UART Disable Mask

#define CR_SIREN_Set              ((uint16_t)0x0002)  // UART IrDA mode Enable Mask
#define CR_SIREN_Reset            ((uint16_t)0xFFFD)  // UART IrDA mode Disable Mask

#define CR_FC_Mask                ((uint16_t)0xFF80)  // UART CR Flow control Bits Mask

#define LCR_H_BRK_Set             ((uint16_t)0x0001)  // UART Break Line Set Mask
#define LCR_H_BRK_Reset           ((uint16_t)0xFFFE)  // UART Break Line Reset Mask
#define LCR_H_Clear_Mask          ((uint16_t)0x00FF)  // UART LCR_H Mask

#define FBRD_Fract_Mask           ((uint16_t)0x003F)  // Fractional divider Mask

#define IrLPBaud16                ((uint32_t)1843200) // F_IrLPBaud16 nominal frequency Hz

#define UART1_BRG_Mask            ((uint32_t)0x0007)  // UART1 clock divider Mask
#define UART2_BRG_Mask            ((uint32_t)0x0700)  // UART2 clock divider Mask
#define UART2_BRG_Offs            ((uint32_t)0x0008)  // UART2 clock divider Offset


//
//
// BKP
//
//

// MDR_BKP

// MDR_BKP->REG_0E

/***************************************************************************************************************/

// MDR_BKP->REG_0E->LOW

#define BKP_REG_0E_LOW_LT_10MHz                      0x0
#define BKP_REG_0E_LOW_LT_200KHz                     0x1
#define BKP_REG_0E_LOW_LT_500KHz                     0x2
#define BKP_REG_0E_LOW_LT_1MHz                       0x3
#define BKP_REG_0E_LOW_EQ_NO_CLK                     0x4
#define BKP_REG_0E_LOW_LT_40MHz                      0x5
#define BKP_REG_0E_LOW_LT_80MHz                      0x6
#define BKP_REG_0E_LOW_GE_80MHz                      0x7

/***************************************************************************************************************/

// MDR_BKP->REG_0E->SelectRI

#define BKP_REG_0E_SELECTRI_6KOhm____ADD_300___mkA              0x00
#define BKP_REG_0E_SELECTRI_270KOhm__ADD_6dot6_mkA              0x08
#define BKP_REG_0E_SELECTRI_90KOhm___ADD_20____mkA              0x10
#define BKP_REG_0E_SELECTRI_24KOhm___ADD_80____mkA              0x18
#define BKP_REG_0E_SELECTRI_900KOhm_IADD_2_____mkA              0x20
#define BKP_REG_0E_SELECTRI_2KOhm____ADD_900___mkA              0x28
#define BKP_REG_0E_SELECTRI_400Ohm___ADD_4dot4_mA               0x30
#define BKP_REG_0E_SELECTRI_100Ohm___ADD_19____mA               0x38

/***************************************************************************************************************/

// standalone can be enabled or disabled :3

/***************************************************************************************************************/

// MDR_BKP->REG_0E->TRIM

#define BKP_REG_0E_TRIM_DUcc_PLUS__DOT10V               0x000
#define BKP_REG_0E_TRIM_DUcc_PLUS__DOT06V               0x100
#define BKP_REG_0E_TRIM_DUcc_PLUS__DOT04V               0x200
#define BKP_REG_0E_TRIM_DUcc_PLUS__DOT01V               0x300
#define BKP_REG_0E_TRIM_DUcc_MINUS_DOT01V               0x400
#define BKP_REG_0E_TRIM_DUcc_MINUS_DOT04V               0x500
#define BKP_REG_0E_TRIM_DUcc_MINUS_DOT06V               0x600
#define BKP_REG_0E_TRIM_DUcc_MINUS_DOT10V               0x700

/***************************************************************************************************************/
// MDR_BKP->REG_0E->FPOR

#define BKP_REG_0E_FPOR_OK                              0x800 // Enable/disable >??????? )))))

/***************************************************************************************************************/

// MDR_BKP->REG_0E->TRIM2

#define BKP_REG_0E_TRIM2_1dot8_V        0x0000
#define BKP_REG_0E_TRIM2_1dot6_V        0x1000
#define BKP_REG_0E_TRIM2_1dot4_V        0x2000
#define BKP_REG_0E_TRIM2_1dot2_V        0x3000

/***************************************************************************************************************/

// Allow shielding from current gt 150 mA   enable disable


//
//
// End of BKP
//
//


/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
// Convertion :::: FILE MDR32F9Qx_ebc.h /*******************************DONE-100%*******************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/

//
//
// EBC_Exported_Types EBC Exported Types
//
//

// EBC Init structure definition
typedef struct
{
  uint32_t EBC_Mode;            // Specifies external bus mode. This parameter can be a value of EBC_MODE. uint32_t EBC_Cpol; Specifies CLOCK signal polarity.This parameter can be a value of EBC_CPOL. */
  uint8_t  EBC_WaitState;       // Specifies wait states number. This parameter can be a value of EBC_WAIT_STATE.
  uint8_t  EBC_NandTrc;         // Specifies NAND read cycle time t_rc. This parameter can be a value of EBC_NAND_CYCLES.
  uint8_t  EBC_NandTwc;         // Specifies NAND write cycle time t_wc. This parameter can be a value of EBC_NAND_CYCLES.
  uint8_t  EBC_NandTrea;        // Specifies NAND read access time t_rea. This parameter can be a value of EBC_NAND_CYCLES.
  uint8_t  EBC_NandTwp;         // Specifies NAND write access time t_wp. This parameter can be a value of EBC_NAND_CYCLES.
  uint8_t  EBC_NandTwhr;        // Specifies NAND status register access time t_whr. This parameter can be a value of  EBC_NAND_CYCLES.
  uint8_t  EBC_NandTalea;       // Specifies NAND ID registers access time t_alea. This parameter can be a value of EBC_NAND_CYCLES.
  uint8_t  EBC_NandTrr;         // Specifies NAND delay from Busy release to read operation. This parameter can be a value of EBC_NAND_CYCLES.
  uint8_t EBC_DataAlignment;    // Specifies data Alignment. This parameter can be a value of EBC_DATA_ALIGNMENT.
  uint8_t EBC_UseMemRegion;     // Specifies resolution settings of exchange of the appropriate range of addresses. This parameter can be value of USE_EBC_MEM_REGION.
}EBC_InitTypeDef;

/***************************************************************************************************************/

// EBC RAM RAM_Cycles structure definition
typedef struct
{
        uint8_t Use_Ready;      // Specifies resolution survey of the external signal to the READY output PF [2]. This parameter can be: ENABLE or DISABLE.
        uint8_t WS_Hold;        // Specifies hold time signals nWE / nOE. This parameter can be a value of EBC_WS_HOLD_CYCLE.
        uint8_t WS_Setup;       // Specifies time preset signals nWE / nOE in cycle read / write. This parameter can be a value of @ref EBC_WS_SETUP_CYCLE.
        uint8_t WS_Active;      // Specifies continued low level signals nWE / nOE in cycle read / write. This parameter can be a number between 0x0000 and 0x7F.
        uint8_t Enable_Tune;    // Specifies resolution settings of exchange of the appropriate range of addresses. This parameter can be: ENABLE or DISABLE.
}EBC_MemRegionInitTypeDef;

//
//
// End of group EBC_Exported_Types
//
//

//
//
// EBC_Exported_Constants EBC Exported Constants
//
//

// EBC_MODE EBC mode

#define EBC_MODE_OFF                ((uint32_t)0x0)                 // EBC disabled
#define EBC_MODE_ROM                (((uint32_t)0x1) << 0)          // EBC works with external ROM
#define EBC_MODE_RAM                (((uint32_t)0x1) << 1)          // EBC works with external RAM
#define EBC_MODE_NAND               (((uint32_t)0x1) << 2)          // EBC works with external NAND Flash memory

#define EBC_MODE_MSK                (EBC_MODE_ROM | EBC_MODE_RAM | EBC_MODE_NAND)

#define IS_EBC_MODE(MODE) (((MODE) == EBC_MODE_OFF ) || \
                               ((MODE) == EBC_MODE_ROM ) || \
                               ((MODE) == EBC_MODE_RAM ) || \
                               ((MODE) == EBC_MODE_NAND))

// End of group EBC_MODE

/***************************************************************************************************************/

// EBC_CPOL EBC CLOCK polarity

