Winterviking/code_examples/uartled/INCLUDE/MDR1986VE1T_Add.h
#define EBC_CPOL_POSITIVE           (((uint32_t)0x0) << 3)         // EBC generates the positive CLOCK signal
#define EBC_CPOL_NEGATIVE           (((uint32_t)0x1) << 3)         // EBC generates the negative CLOCK signal

#define IS_EBC_CPOL(CPOL) (((CPOL) == EBC_CPOL_POSITIVE) || \
                               ((CPOL) == EBC_CPOL_NEGATIVE))

// End of group EBC_CPOL

/***************************************************************************************************************/

// EBC_WAIT_STATE EBC Wait States number

#define EBC_WAIT_STATE_3HCLK        ((uint32_t)0x0)                 // Wait State = 3 HCLK clocks
#define EBC_WAIT_STATE_4HCLK        ((uint32_t)0x1)                 // Wait State = 4 HCLK clocks
#define EBC_WAIT_STATE_5HCLK        ((uint32_t)0x2)                 // Wait State = 5 HCLK clocks
#define EBC_WAIT_STATE_6HCLK        ((uint32_t)0x3)                 // Wait State = 6 HCLK clocks
#define EBC_WAIT_STATE_7HCLK        ((uint32_t)0x4)                 // Wait State = 7 HCLK clocks
#define EBC_WAIT_STATE_8HCLK        ((uint32_t)0x5)                 // Wait State = 8 HCLK clocks
#define EBC_WAIT_STATE_9HCLK        ((uint32_t)0x6)                 // Wait State = 9 HCLK clocks
#define EBC_WAIT_STATE_10HCLK       ((uint32_t)0x7)                 // Wait State = 10 HCLK clocks
#define EBC_WAIT_STATE_11HCLK       ((uint32_t)0x8)                 // Wait State = 11 HCLK clocks
#define EBC_WAIT_STATE_12HCLK       ((uint32_t)0x9)                 // Wait State = 12 HCLK clocks
#define EBC_WAIT_STATE_13HCLK       ((uint32_t)0xA)                 // Wait State = 13 HCLK clocks
#define EBC_WAIT_STATE_14HCLK       ((uint32_t)0xB)                 // Wait State = 14 HCLK clocks
#define EBC_WAIT_STATE_15HCLK       ((uint32_t)0xC)                 // Wait State = 15 HCLK clocks
#define EBC_WAIT_STATE_16HCLK       ((uint32_t)0xD)                 // Wait State = 16 HCLK clocks
#define EBC_WAIT_STATE_17HCLK       ((uint32_t)0xE)                 // Wait State = 17 HCLK clocks
#define EBC_WAIT_STATE_18HCLK       ((uint32_t)0xF)                 // Wait State = 18 HCLK clocks

#define EBC_WAIT_STATE_MSK          ((uint32_t)0xF)                 // Wait State value mask

#define IS_EBC_WAIT_STATE(WAIT_STATE) (((WAIT_STATE) & ~EBC_WAIT_STATE_MSK) == 0 )

// End of group EBC_WAIT_STATE

/***************************************************************************************************************/

// EBC_NAND_CYCLES EBC NAND Cycles

#define EBC_NAND_CYCLES_0HCLK       ((uint32_t)0x0)                 // NAND Cycles = 0 HCLK clocks
#define EBC_NAND_CYCLES_1HCLK       ((uint32_t)0x1)                 // NAND Cycles = 1 HCLK clocks
#define EBC_NAND_CYCLES_2HCLK       ((uint32_t)0x2)                 // NAND Cycles = 2 HCLK clocks
#define EBC_NAND_CYCLES_3HCLK       ((uint32_t)0x3)                 // NAND Cycles = 3 HCLK clocks
#define EBC_NAND_CYCLES_4HCLK       ((uint32_t)0x4)                 // NAND Cycles = 4 HCLK clocks
#define EBC_NAND_CYCLES_5HCLK       ((uint32_t)0x5)                 // NAND Cycles = 5 HCLK clocks
#define EBC_NAND_CYCLES_6HCLK       ((uint32_t)0x6)                 // NAND Cycles = 6 HCLK clocks
#define EBC_NAND_CYCLES_7HCLK       ((uint32_t)0x7)                 // NAND Cycles = 7 HCLK clocks
#define EBC_NAND_CYCLES_8HCLK       ((uint32_t)0x8)                 // NAND Cycles = 8 HCLK clocks
#define EBC_NAND_CYCLES_9HCLK       ((uint32_t)0x9)                 // NAND Cycles = 9 HCLK clocks
#define EBC_NAND_CYCLES_10HCLK      ((uint32_t)0xA)                 // NAND Cycles = 10 HCLK clocks
#define EBC_NAND_CYCLES_11HCLK      ((uint32_t)0xB)                 // NAND Cycles = 11 HCLK clocks
#define EBC_NAND_CYCLES_12HCLK      ((uint32_t)0xC)                 // NAND Cycles = 12 HCLK clocks
#define EBC_NAND_CYCLES_13HCLK      ((uint32_t)0xD)                 // NAND Cycles = 13 HCLK clocks
#define EBC_NAND_CYCLES_14HCLK      ((uint32_t)0xE)                 // NAND Cycles = 14 HCLK clocks
#define EBC_NAND_CYCLES_15HCLK      ((uint32_t)0xF)                 // NAND Cycles = 15 HCLK clocks

#define EBC_NAND_CYCLES_MSK         ((uint32_t)0xF)                 // NAND Cycles value mask

#define IS_EBC_NAND_CYCLES(NAND_CYCLES) (((NAND_CYCLES) & ~EBC_NAND_CYCLES_MSK) == 0 )

// End of group EBC_NAND_CYCLES

/***************************************************************************************************************/

// EBC_DATA_ALIGNMENT EBC DATA ALIGNMENT

#define EBC_EBC_DATA_ALIGNMENT_OFF      ((uint32_t)0x0)              // Not use data alignment
#define EBC_EBC_DATA_ALIGNMENT_8        ((uint32_t)0x20)             // Data alignment to 8 junior ranks EBC
#define EBC_EBC_DATA_ALIGNMENT_16       ((uint32_t)0x40)             // Data alignment to 16 junior ranks EBC

#define IS_EBC_DATA_ALIGNMENT(EBC_DATA_ALIGNMENT)       ((EBC_DATA_ALIGNMENT == EBC_EBC_DATA_ALIGNMENT_OFF) || \
                                                        (EBC_DATA_ALIGNMENT == EBC_EBC_DATA_ALIGNMENT_8)   || \
                                                        (EBC_DATA_ALIGNMENT == EBC_EBC_DATA_ALIGNMENT_16))

// End of group EBC_DATA_ALIGNMENT EBC DATA ALIGNMENT

/***************************************************************************************************************/

// EBC_MEM_REGION EBC MEM REGION

#define EBC_USE_MEM_REGION_NONE                 ((uint32_t)0x0)
#define EBC_USE_MEM_REGION_1                    ((uint32_t)0x1)
#define EBC_USE_MEM_REGION_2                    ((uint32_t)0x2)
#define EBC_USE_MEM_REGION_3                    ((uint32_t)0x4)
#define EBC_USE_MEM_REGION_4                    ((uint32_t)0x8)

#define IS_EBC_USE_MEM_REGION(EBC_USE_MEM_REGION)                       ((EBC_USE_MEM_REGION == EBC_USE_MEM_REGION_NONE) || \
                                                                         (EBC_USE_MEM_REGION == EBC_USE_MEM_REGION_1)    || \
                                                                         (EBC_USE_MEM_REGION == EBC_USE_MEM_REGION_2)    || \
                                                                         (EBC_USE_MEM_REGION == EBC_USE_MEM_REGION_3)    || \
                                                                         (EBC_USE_MEM_REGION == EBC_USE_MEM_REGION_4))

// End of groupe EBC_MEM_REGION EBC MEM REGION

/***************************************************************************************************************/

// EBC_WS_HOLD_CYCLE WS HOLD Cycles

#define EBC_WS_HOLD_CYCLE_1HCLK         ((uint32_t)0x00)                // WS HOLD Cycles = 1 HCLK clocks
#define EBC_WS_HOLD_CYCLE_2HCLK         ((uint32_t)0x01)                // WS HOLD Cycles = 2 HCLK clocks
#define EBC_WS_HOLD_CYCLE_3HCLK         ((uint32_t)0x02)                // WS HOLD Cycles = 3 HCLK clocks
#define EBC_WS_HOLD_CYCLE_4HCLK         ((uint32_t)0x03)                // WS HOLD Cycles = 4 HCLK clocks
#define EBC_WS_HOLD_CYCLE_5HCLK         ((uint32_t)0x04)                // WS HOLD Cycles = 5 HCLK clocks
#define EBC_WS_HOLD_CYCLE_6HCLK         ((uint32_t)0x05)                // WS HOLD Cycles = 6 HCLK clocks
#define EBC_WS_HOLD_CYCLE_7HCLK         ((uint32_t)0x06)                // WS HOLD Cycles = 7 HCLK clocks
#define EBC_WS_HOLD_CYCLE_8HCLK         ((uint32_t)0x07)                // WS HOLD Cycles = 8 HCLK clocks

#define EBC_WS_HOLD_CYCLES_MSK  0x07

#define IS_EBC_EBC_WS_HOLD_CYCLES(EBC_WS_HOLD_CYCLES) (((EBC_WS_HOLD_CYCLES) & ~EBC_WS_HOLD_CYCLES_MSK) == 0 )

// End of groupe EBC_WS_HOLD_CYCLE WS HOLD Cycles

/***************************************************************************************************************/

// EBC_WS_SETUP_CYCLE WS SETUP Cycles

#define EBC_WS_SETUP_CYCLE_1HCLK                ((uint32_t)0x00)                /*!<  WS SETUP Cycles = 1 HCLK clocks */
#define EBC_WS_SETUP_CYCLE_2HCLK                ((uint32_t)0x01)                /*!<  WS SETUP Cycles = 2 HCLK clocks */
#define EBC_WS_SETUP_CYCLE_3HCLK                ((uint32_t)0x02)                /*!<  WS SETUP Cycles = 3 HCLK clocks */
#define EBC_WS_SETUP_CYCLE_4HCLK                ((uint32_t)0x03)                /*!<  WS SETUP Cycles = 4 HCLK clocks */
#define EBC_WS_SETUP_CYCLE_5HCLK                ((uint32_t)0x04)                /*!<  WS SETUP Cycles = 5 HCLK clocks */
#define EBC_WS_SETUP_CYCLE_6HCLK                ((uint32_t)0x05)                /*!<  WS SETUP Cycles = 6 HCLK clocks */
#define EBC_WS_SETUP_CYCLE_7HCLK                ((uint32_t)0x06)                /*!<  WS SETUP Cycles = 7 HCLK clocks */
#define EBC_WS_SETUP_CYCLE_8HCLK                ((uint32_t)0x07)                /*!<  WS SETUP Cycles = 8 HCLK clocks */

#define EBC_WS_SETUP_CYCLES_MSK 0x07

#define IS_EBC_WS_SETUP_CYCLES(EBC_WS_SETUP_CYCLES) (((EBC_WS_SETUP_CYCLES) & ~EBC_WS_SETUP_CYCLES_MSK) == 0 )

// groupe EBC_WS_SETUP_CYCLE WS SETUP Cycles

/***************************************************************************************************************/

// EBC_MEM_REGIONx EBC MEM REGION

#define EBC_MEM_REGION_10000000         (uint32_t)(0x00)
#define EBC_MEM_REGION_50000000         (uint32_t)(0x01)
#define EBC_MEM_REGION_60000000         (uint32_t)(0x02)
#define EBC_MEM_REGION_70000000         (uint32_t)(0x03)

#define IS_EBC_MEM_REGION(EBC_MEM_REGION)         ((EBC_MEM_REGION == EBC_MEM_REGION_10000000) || \
                                                   (EBC_MEM_REGION == EBC_MEM_REGION_50000000) || \
                                                   (EBC_MEM_REGION == EBC_MEM_REGION_60000000) || \
                                                   (EBC_MEM_REGION == EBC_MEM_REGION_70000000))

// End of groupe EBC_MEM_REGIONx EBC MEM REGION

#define IS_EBC_WS_ACTIVE(WS_ACTIVE)                             ((WS_ACTIVE >= 0) && (WS_ACTIVE < 127))

//
//
// End of group EBC_Exported_Constants
//
//

//
// Bonus EBC defines
//
#define EBC_MEM_REGION_ENABLE_TUNE






















































//
//
// MACRO
//
//

#define SETBITS(value__,position__) value__ << position__



//
//
// PAUSE DELAY
//
//

// global pause counter
extern u32 ipause;

// global pause maximum
//int HCLK = HSE_Value*(RST_CLK_CPU_PLLmul6 + 1);
extern const u32 HCLK;
extern u32 maxpause_s;
extern u32 maxpause_ms;
extern u32 maxpause_mks;
extern const u32 PLL_MUL;

// I need pauses :3   approx 25 coeff at 48MHz
#define DELAY_MS(ms) maxpause_ms=(HCLK/20300)*ms;for(ipause = 0; ipause < maxpause_ms; ipause++);
#define DELAY_MKS(mks) maxpause_mks=(HCLK/20300000)*mks;for(ipause = 0; ipause < maxpause_mks; ipause++);
#define DELAY_S(s) maxpause_s=HCLK / 20;for(ipause = 0; ipause < maxpause_s; ipause++);

#endif // End of __MDR_DEFINITIONS_H_INCLUDED__

